andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#ifndef __LPC175X_H
#define __LPC175X_H

#include "uc_libdefs.h"


// ########################################################################################################################################
// WATCHDOG
#define WDG_BASE_ADDR		0x40000000

#define WDMOD          (*(reg32 *)(WDG_BASE_ADDR + 0x00)) // Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer.
	#define WDEN 		(1<<0) // Habilita o contador. Não é limpo por software;
	#define WDRESET  	(1<<1) // Habilita o reset quando zerar o contador. Não é limpo por software;
	#define	WDOF 		(1<<2) // Sinalizador que o reset foi emitido pelo watchdog, é limpo somente via software;
	#define WDINT 		(1<<3) // Bit somente leitura, sinalizador de interrupção.

#define WDTC           (*(reg32 *)(WDG_BASE_ADDR + 0x04)) // Watchdog timer constant register. This register determines the time-out value.
#define WDFEED         (*(reg32 *)(WDG_BASE_ADDR + 0x08)) // Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this  register reloads the Watchdog timer with the value contained in WDTC
#define WDTV           (*(reg32 *)(WDG_BASE_ADDR + 0x0C)) // Watchdog timer value register. This register reads out the current value of the Watchdog timer.
#define WDCLKSEL 	   (*(reg32 *)(WDG_BASE_ADDR + 0x10)) // Watchdog clock source selection register.
	#define WDCLK_RC   	0 // clock RC (4MHz) para o contador do watchdog
	#define WDCLK_PCLK  1 // clock PCLK para o contador do watchdog
	#define WDCLK_RTC   2 // clock RTC (32768khz) para o contador do watchdog

// ########################################################################################################################################
// REGISTRADORES GENÉRICOS
// Registradores de uso geral que alimentados pela bateria do RTC não perdem seu valor.
//	Estes registradores não são afetados pelo reset
#define GPREG_BASE     	0x40024044
#define GPREG0         	(*(reg32 *)(GPREG_BASE))
#define GPREG1         	(*(reg32 *)(GPREG_BASE + 0x04))
#define GPREG2         	(*(reg32 *)(GPREG_BASE + 0x08))
#define GPREG3         	(*(reg32 *)(GPREG_BASE + 0x0C))
#define GPREG4         	(*(reg32 *)(GPREG_BASE + 0x10))


// ########################################################################################################################################
// REGISTRADORES DO SYSTICK
#define TMRSYS_BASE_ADDR	0xe000e000

#define STCTRL  	(*(reg32 *)(TMRSYS_BASE_ADDR + 0x010)) // Controle do timer
	#define STCTRL_ENABLE    (1 << 0)        		  	   // Habilita contagem
	#define STCTRL_TICKINT   (1 << 1)        		  	   // Habilita interrupção
	#define STCTRL_CLKSOURCE (1 << 2)        		  	   // Fonte do clock. Valor 1 fonte CCLK, valor 0 fonte externa

#define STRELOAD  	(*(reg32 *)(TMRSYS_BASE_ADDR + 0x014))
#define STCURR  	(*(reg32 *)(TMRSYS_BASE_ADDR + 0x018))
#define STCALIB  	(*(reg32 *)(TMRSYS_BASE_ADDR + 0x01C))

#define NVIC_SYSPRI2_REG	( * ( ( volatile u32 * ) 0xe000ed20 ) )

// ########################################################################################################################################
// REGISTRADORES DO TIMER 0

#define TMR0_BASE_ADDR		0x40004000

#define T0IR           (*(reg32 *)(TMR0_BASE_ADDR + 0x00))	// Registrador de interrupções
	#define T0IR_MR0I    (1 << 0)        			    		// Flag de interrupção do canal de comparação 0
	#define T0IR_MR1I    (1 << 1)       			     		// Flag de interrupção do canal de comparação 1
	#define T0IR_MR2I    (1 << 2)       			     		// Flag de interrupção do canal de comparação 2
	#define T0IR_MR3I    (1 << 3)       			     		// Flag de interrupção do canal de comparação 3
	#define T0IR_CR0I    (1 << 4)        			    		// Flag de interrupção do canal de captura 0
	#define T0IR_CR1I    (1 << 5)         				   		// Flag de interrupção do canal de captura 1

#define T0TCR          (*(reg32 *)(TMR0_BASE_ADDR + 0x04))	// Registrador de controle de timer
	#define T0TCR_ENABLE  (1 << 0)								// Habilita o contador do timer
	#define T0TCR_STOP    (0)									// Desabilita o contador do timer
	#define T0TCR_RESET   (1 << 1)								// Zera o contador do timer

#define T0TC           (*(reg32 *)(TMR0_BASE_ADDR + 0x08))	// Contador do timer

#define T0PR           (*(reg32 *)(TMR0_BASE_ADDR + 0x0C))	// Registrador do prescaler (0 a 0xFFFFFFFF)
	#define	T0MPR_DIV1		0
	#define	T0MPR_DIV2		1
	#define	T0MPR_DIV4		3
	#define	T0MPR_DIV8		7
	#define	T0MPR_DIV16		15
	#define	T0MPR_DIV32		31
	#define	T0MPR_DIV64		63
	#define	T0MPR_DIV128	127
	#define	T0MPR_DIV256	255
	#define	T0MPR_DIV512	511
	#define	T0MPR_DIV1024	1023

#define T0PC           (*(reg32 *)(TMR0_BASE_ADDR + 0x10))	// Contador do prescaler

#define T0MCR          (*(reg32 *)(TMR0_BASE_ADDR + 0x14))	// Registrador do controle de comparações (Match Control)
	#define T0MCR_NO_INT  				(0)						// Sem interrupções para match ou PWM
	#define T0MCR_OVERFLOW  			(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC para contagem de overflow
	#define T0MCR_MR0_INT_ENABLE  		(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC
	#define T0MCR_MR0_RESET  			(1 << 1)  		      	// Reseta TC quando ele for igual a MR0
	#define T0MCR_MR0_STOP  			(1 << 2)       		 	// Para TC e PC quando MR0 for igual a TC
	#define T0MCR_MR1_INT_ENABLE  		(1 << 3)		     	// Habilita a interrupção quando MR1 for igual a TC
	#define T0MCR_MR1_RESET 			(1 << 4)       		 	// Reseta TC quando ele for igual a MR1
	#define T0MCR_MR1_STOP  			(1 << 5)        		// Para TC e PC quando MR1 for igual a TC
	#define T0MCR_MR2_INT_ENABLE   		(1 << 6)       		 	// Habilita a interrupção quando MR2 for igual a TC
	#define T0MCR_MR2_RESET  			(1 << 7)        		// Reseta TC quando ele for igual a MR2
	#define T0MCR_MR2_STOP  			(1 << 8)        		// Para TC e PC quando MR2 for igual a TC
	#define T0MCR_MR3_INT_ENABLE   		(1 << 9)        		// Habilita a interrupção quando MR3 for igual a TC
	#define T0MCR_MR3_RESET  			(1 << 10)       		// Reseta TC quando ele for igual a MR3
	#define T0MCR_MR3_STOP  			(1 << 11)       		// Para TC e PC quando MR3 for igual a TC

#define T0MR0          (*(reg32 *)(TMR0_BASE_ADDR + 0x18))	// Registrador de comparação 0
#define T0MR1          (*(reg32 *)(TMR0_BASE_ADDR + 0x1C))	// Registrador de comparação 1
#define T0MR2          (*(reg32 *)(TMR0_BASE_ADDR + 0x20))	// Registrador de comparação 2
#define T0MR3          (*(reg32 *)(TMR0_BASE_ADDR + 0x24))	// Registrador de comparação 3

