andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#define T1CTCR         (*(reg32 *)(TMR1_BASE_ADDR + 0x70))

// ########################################################################################################################################
// REGISTRADORES DO TIMER 2
#define TMR2_BASE_ADDR		0x40090000

#define T2IR           (*(reg32 *)(TMR2_BASE_ADDR + 0x00))	// Registrador de interrupções
	#define T2IR_MR0I    (1 << 0)        			    		// Flag de interrupção do canal de comparação 0
	#define T2IR_MR1I    (1 << 1)       			     		// Flag de interrupção do canal de comparação 1
	#define T2IR_MR2I    (1 << 2)       			     		// Flag de interrupção do canal de comparação 2
	#define T2IR_MR3I    (1 << 3)       			     		// Flag de interrupção do canal de comparação 3
	#define T2IR_CR0I    (1 << 4)        			    		// Flag de interrupção do canal de captura 0
	#define T2IR_CR1I    (1 << 5)         				   		// Flag de interrupção do canal de captura 1

#define T2TCR          (*(reg32 *)(TMR2_BASE_ADDR + 0x04))	// Registrador de controle de timer
	#define T2TCR_ENABLE  (1 << 0)								// Habilita o contador do timer
	#define T2TCR_STOP    (0)									// Desabilita o contador do timer
	#define T2TCR_RESET   (1 << 1)								// Zera o contador do timer

#define T2TC           (*(reg32 *)(TMR2_BASE_ADDR + 0x08))	// Contador do timer

#define T2PR           (*(reg32 *)(TMR2_BASE_ADDR + 0x0C))	// Registrador do prescaler (0 a 0xFFFFFFFF)
	#define	T2MPR_DIV1		0
	#define	T2MPR_DIV2		1
	#define	T2MPR_DIV4		3
	#define	T2MPR_DIV8		7
	#define	T2MPR_DIV16		15
	#define	T2MPR_DIV32		31
	#define	T2MPR_DIV64		63
	#define	T2MPR_DIV128	127
	#define	T2MPR_DIV256	255
	#define	T2MPR_DIV512	511
	#define	T2MPR_DIV1024	1023

#define T2PC           (*(reg32 *)(TMR2_BASE_ADDR + 0x10))	// Contador do prescaler

#define T2MCR          (*(reg32 *)(TMR2_BASE_ADDR + 0x14))	// Registrador do controle de comparações (Match Control)
	#define T2MCR_NO_INT  				0						// Sem interrupções para match ou PWM
	#define T2MCR_OVERFLOW  			(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC
	#define T2MCR_MR0_INT_ENABLE  		(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC
	#define T2MCR_MR0_RESET  			(1 << 1)  		      	// Reseta MR0 quando ele for igual a TC
	#define T2MCR_MR0_STOP  			(1 << 2)       		 	// Para TC e PC quando MR0 for igual a TC
	#define T2MCR_MR1_INT_ENABLE  		(1 << 3)		     	// Habilita a interrupção quando MR1 for igual a TC
	#define T2MCR_MR1_RESET 			(1 << 4)       		 	// Reseta MR1 quando ele for igual a TC
	#define T2MCR_MR1_STOP  			(1 << 5)        		// Para TC e PC quando MR1 for igual a TC
	#define T2MCR_MR2_INT_ENABLE   		(1 << 6)       		 	// Habilita a interrupção quando MR2 for igual a TC
	#define T2MCR_MR2_RESET  			(1 << 7)        		// Reseta MR2 quando ele for igual a TC
	#define T2MCR_MR2_STOP  			(1 << 8)        		// Para TC e PC quando MR2 for igual a TC
	#define T2MCR_MR3_INT_ENABLE   		(1 << 9)        		// Habilita a interrupção quando MR3 for igual a TC
	#define T2MCR_MR3_RESET  			(1 << 10)       		// Reseta MR3 quando ele for igual a TC
	#define T2MCR_MR3_STOP  			(1 << 11)       		// Para TC e PC quando MR3 for igual a TC

#define T2MR0          (*(reg32 *)(TMR2_BASE_ADDR + 0x18))	// Registrador de comparação 0
#define T2MR1          (*(reg32 *)(TMR2_BASE_ADDR + 0x1C))	// Registrador de comparação 1
#define T2MR2          (*(reg32 *)(TMR2_BASE_ADDR + 0x20))	// Registrador de comparação 2
#define T2MR3          (*(reg32 *)(TMR2_BASE_ADDR + 0x24))	// Registrador de comparação 3

#define T2CCR          (*(reg32 *)(TMR2_BASE_ADDR + 0x28))	// Registrador de controle de captura
	#define T2CCR_CR0_RISING	(1 << 0)     	  				// Habilita a captura do TC para CR0 durante a subida da borda CAPn.0
	#define T2CCR_CR0_FALLING	(1 << 1)    	    			// Habilita a captura do TC para CR0 durante a queda da borda CAPn.0
	#define T2CCR_CR0_INT 		(1 << 2)        				// Habilita a interrupção para ler o CR0
	#define T2CCR_CR1_RISING	(1 << 3)        				// Habilita a captura do TC para CR1 durante a subida da borda CAPn.1
	#define T2CCR_CR1_FALLING 	(1 << 4)        				// Habilita a captura do TC para CR1 durante a queda da borda CAPn.1
	#define T2CCR_CR1_INT 		(1 << 5)        				// Habilita a interrupção para ler o CR1

#define T2CR0          (*(reg32 *)(TMR2_BASE_ADDR + 0x2C))	// Registrador de captura 0
#define T2CR1          (*(reg32 *)(TMR2_BASE_ADDR + 0x30))	// Registrador de captura 1
#define T2EMR          (*(reg32 *)(TMR2_BASE_ADDR + 0x3C))	// Registrador de comparação externa
	#define T2EMR_EM0_MASK			0x1
	#define T2EMR_EM0_BITPIN		0

	#define T2EMR_EMC0_MASK			0x30
	#define T2EMR_EMC0_DONOTHING	0x0 	// Faz nada quando chegar na comparação
	#define T2EMR_EMC0_CLRPIN		0x10 	// Clear corresponding External Match output to 0 (LOW if pinned out)
	#define T2EMR_EMC0_SETPIN		0x20 	// Set corresponding External Match output to 1(HIGH if pinned out)
	#define T2EMR_EMC0_TOGGLEPIN	0x30 	// Toggle corresponding External Match output

	#define T2EMR_EMC1_MASK			0xC0
	#define T2EMR_EMC1_DONOTHING	0x0 	// Faz nada quando chegar na comparação
	#define T2EMR_EMC1_CLRPIN		0x40 	// Clear corresponding External Match output to 0 (LOW if pinned out)
	#define T2EMR_EMC1_SETPIN		0x80 	// Set corresponding External Match output to 1(HIGH if pinned out)
	#define T2EMR_EMC1_TOGGLEPIN	0xC0 	// Toggle corresponding External Match output

#define T2CTCR         (*(reg32 *)(TMR2_BASE_ADDR + 0x70))

// ########################################################################################################################################
// REGISTRADORES DO TIMER 3
#define TMR3_BASE_ADDR		0x40094000

#define T3IR           (*(reg32 *)(TMR3_BASE_ADDR + 0x00))	// Registrador de interrupções
	#define T3IR_MR0I    (1 << 0)        			    		// Flag de interrupção do canal de comparação 0
	#define T3IR_MR1I    (1 << 1)       			     		// Flag de interrupção do canal de comparação 1
	#define T3IR_MR2I    (1 << 2)       			     		// Flag de interrupção do canal de comparação 2
	#define T3IR_MR3I    (1 << 3)       			     		// Flag de interrupção do canal de comparação 3
	#define T3IR_CR0I    (1 << 4)        			    		// Flag de interrupção do canal de captura 0
	#define T3IR_CR1I    (1 << 5)         				   		// Flag de interrupção do canal de captura 1

#define T3TCR          (*(reg32 *)(TMR3_BASE_ADDR + 0x04))	// Registrador de controle de timer
	#define T3TCR_ENABLE  (1 << 0)								// Habilita o contador do timer
	#define T3TCR_STOP    (0)									// Desabilita o contador do timer
	#define T3TCR_RESET   (1 << 1)								// Zera o contador do timer

#define T3TC           (*(reg32 *)(TMR3_BASE_ADDR + 0x08))	// Contador do timer

#define T3PR           (*(reg32 *)(TMR3_BASE_ADDR + 0x0C))	// Registrador do prescaler (0 a 0xFFFFFFFF)
	#define	T3MPR_DIV1		0
	#define	T3MPR_DIV2		1
	#define	T3MPR_DIV4		3
	#define	T3MPR_DIV8		7
	#define	T3MPR_DIV16		15
	#define	T3MPR_DIV32		31
	#define	T3MPR_DIV64		63
	#define	T3MPR_DIV128	127
	#define	T3MPR_DIV256	255
	#define	T3MPR_DIV512	511
	#define	T3MPR_DIV1024	1023

#define T3PC           (*(reg32 *)(TMR3_BASE_ADDR + 0x10))	// Contador do prescaler

#define T3MCR          (*(reg32 *)(TMR3_BASE_ADDR + 0x14)))	// Registrador do controle de comparações (Match Control)
	#define T3MCR_NO_INT  				0						// Sem interrupções para match ou PWM
	#define T3MCR_OVERFLOW  			(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC
	#define T3MCR_MR0_INT_ENABLE  		(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC
	#define T3MCR_MR0_RESET  			(1 << 1)  		      	// Reseta MR0 quando ele for igual a TC
	#define T3MCR_MR0_STOP  			(1 << 2)       		 	// Para TC e PC quando MR0 for igual a TC
	#define T3MCR_MR1_INT_ENABLE  		(1 << 3)		     	// Habilita a interrupção quando MR1 for igual a TC
	#define T3MCR_MR1_RESET 			(1 << 4)       		 	// Reseta MR1 quando ele for igual a TC
	#define T3MCR_MR1_STOP  			(1 << 5)        		// Para TC e PC quando MR1 for igual a TC
	#define T3MCR_MR2_INT_ENABLE   		(1 << 6)       		 	// Habilita a interrupção quando MR2 for igual a TC
	#define T3MCR_MR2_RESET  			(1 << 7)        		// Reseta MR2 quando ele for igual a TC
	#define T3MCR_MR2_STOP  			(1 << 8)        		// Para TC e PC quando MR2 for igual a TC
	#define T3MCR_MR3_INT_ENABLE   		(1 << 9)        		// Habilita a interrupção quando MR3 for igual a TC
	#define T3MCR_MR3_RESET  			(1 << 10)       		// Reseta MR3 quando ele for igual a TC
	#define T3MCR_MR3_STOP  			(1 << 11)       		// Para TC e PC quando MR3 for igual a TC

