andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#define T3MR0          (*(reg32 *)(TMR3_BASE_ADDR + 0x18)))	// Registrador de comparação 0
#define T3MR1          (*(reg32 *)(TMR3_BASE_ADDR + 0x1C)))	// Registrador de comparação 1
#define T3MR2          (*(reg32 *)(TMR3_BASE_ADDR + 0x20)))	// Registrador de comparação 2
#define T3MR3          (*(reg32 *)(TMR3_BASE_ADDR + 0x24))	// Registrador de comparação 3

#define T3CCR          (*(reg32 *)(TMR3_BASE_ADDR + 0x28))	// Registrador de controle de captura
	#define T3CCR_CR0_RISING	(1 << 0)     	  				// Habilita a captura do TC para CR0 durante a subida da borda CAPn.0
	#define T3CCR_CR0_FALLING	(1 << 1)    	    			// Habilita a captura do TC para CR0 durante a queda da borda CAPn.0
	#define T3CCR_CR0_INT 		(1 << 2)        				// Habilita a interrupção para ler o CR0
	#define T3CCR_CR1_RISING	(1 << 3)        				// Habilita a captura do TC para CR1 durante a subida da borda CAPn.1
	#define T3CCR_CR1_FALLING 	(1 << 4)        				// Habilita a captura do TC para CR1 durante a queda da borda CAPn.1
	#define T3CCR_CR1_INT 		(1 << 5)        				// Habilita a interrupção para ler o CR1

#define T3CR0          (*(reg32 *)(TMR3_BASE_ADDR + 0x2C))	// Registrador de captura 0
#define T3CR1          (*(reg32 *)(TMR3_BASE_ADDR + 0x30))	// Registrador de captura 1
#define T3EMR          (*(reg32 *)(TMR3_BASE_ADDR + 0x3C))	// Registrador de comparação externa
#define T3CTCR         (*(reg32 *)(TMR3_BASE_ADDR + 0x70))

// ########################################################################################################################################
// PWM1 - PULSE WIDTH MODULATOR
#define PWM1_BASE_ADDR		0x40018000

#define PWM1IR          (*(reg32 *)(PWM1_BASE_ADDR + 0x00))			//  Interrupt Register
	#define PW1MIR_MR0I  (1 << 0)            							// Flag de interrupção PWM0
	#define PW1MIR_MR1I  (1 << 1)         						 		// Flag de interrupção PWM1
	#define PW1MIR_MR2I  (1 << 2)    						       		// Flag de interrupção PWM2
	#define PW1MIR_MR3I  (1 << 3)            							// Flag de interrupção PWM3
	#define PW0MIR_CAP0I (1 << 4)            							// Flag de interrupção CAP0
	#define PW0MIR_CAP1I (1 << 5)            							// Flag de interrupção CAP1
	#define PW1MIR_MR4I  (1 << 8)            							// Flag de interrupção PWM4
	#define PW1MIR_MR5I  (1 << 9)            							// Flag de interrupção PWM5
	#define PW1MIR_MR6I  (1 << 10)           							// Flag de interrupção PWM6
	#define PW1MIR_MASK  (0x073F)

#define PWM1TCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x04))			// Timer Control Register
	#define PWM1TCR_ENABLE  (1 << 0)								// Habilita o contador do timer
	#define PWM1TCR_STOP    (0)										// Desabilita o contador do timer
	#define PWM1TCR_RESET   (1 << 1)								// Zera o contador do timer
	#define PWM1TCR_PWMEN   (1 << 3)								// Habilita modo PWM

#define PWM1TC          (*(reg32 *)(PWM1_BASE_ADDR + 0x08))         // Timer Counter
#define PWM1PR          (*(reg32 *)(PWM1_BASE_ADDR + 0x0C))         // Prescale Register
#define PWM1PC          (*(reg32 *)(PWM1_BASE_ADDR + 0x10))         // Prescale Counter Register
#define PWM1MCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x14))        	// Match Control Register
	#define PWM1MCR_ENABLE 		(1 << 0)								// Habilita o contador do timer PWM
	#define PWM1MCR_RESET  		(1 << 1)								// Zera o contador do timer PWM
	#define PWM1MCR_PWM_ENABLE  (1 << 3)

#define PWM1MR0         (*(reg32 *)(PWM1_BASE_ADDR + 0x18))			// Match Register 0
#define PWM1MR1         (*(reg32 *)(PWM1_BASE_ADDR + 0x1C))			// Match Register 1
#define PWM1MR2         (*(reg32 *)(PWM1_BASE_ADDR + 0x20))			// Match Register 2
#define PWM1MR3         (*(reg32 *)(PWM1_BASE_ADDR + 0x24))			// Match Register 3
#define PWM1CCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x28))
#define PWM1CR0         (*(reg32 *)(PWM1_BASE_ADDR + 0x2C))
#define PWM1CR1         (*(reg32 *)(PWM1_BASE_ADDR + 0x30))
#define PWM1CR2         (*(reg32 *)(PWM1_BASE_ADDR + 0x34))
#define PWM1CR3         (*(reg32 *)(PWM1_BASE_ADDR + 0x38))
#define PWM1EMR         (*(reg32 *)(PWM1_BASE_ADDR + 0x3C))
#define PWM1MR4         (*(reg32 *)(PWM1_BASE_ADDR + 0x40))			// Match Register 4
#define PWM1MR5         (*(reg32 *)(PWM1_BASE_ADDR + 0x44))			// Match Register 5
#define PWM1MR6         (*(reg32 *)(PWM1_BASE_ADDR + 0x48))			// Match Register 6
#define PWM1PCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x4C))			// Control Register
  	#define PWM1PCR_PWM_SEL2	(1 << 2)								// Seleciona o controle de dupla borda para o PWM2. 0 = borda simples / 1 = Dupla borda
	#define PWM1PCR_PWM_SEL3	(1 << 3)								// Seleciona o controle de dupla borda para o PWM3. 0 = borda simples / 1 = Dupla borda
	#define PWM1PCR_PWM_SEL4	(1 << 4)								// Seleciona o controle de dupla borda para o PWM4. 0 = borda simples / 1 = Dupla borda
	#define PWM1PCR_PWM_SEL5	(1 << 5)								// Seleciona o controle de dupla borda para o PWM5. 0 = borda simples / 1 = Dupla borda
	#define PWM1PCR_PWM_SEL6	(1 << 6)								// Seleciona o controle de dupla borda para o PWM6. 0 = borda simples / 1 = Dupla borda
	#define PWM1PCR_PWM_ENABLE1	(1 << 9)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
	#define PWM1PCR_PWM_ENABLE2	(1 << 10)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
	#define PWM1PCR_PWM_ENABLE3	(1 << 11)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
	#define PWM1PCR_PWM_ENABLE4	(1 << 12)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
	#define PWM1PCR_PWM_ENABLE5	(1 << 13)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
	#define PWM1PCR_PWM_ENABLE6	(1 << 14)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita

#define PWM1LER         (*(reg32 *)(PWM1_BASE_ADDR + 0x50))			// Latch Enable Register
  	#define PWM1LER_DISABLE			0									// Desbilita todos os registradores latchs do PWM
	#define PWM1LER0_ENABLE			(1 << 0)							// Habilita o registrador latch do PWM0
	#define PWM1LER1_ENABLE			(1 << 1)							// Habilita o registrador latch do PWM1
	#define PWM1LER2_ENABLE			(1 << 2)							// Habilita o registrador latch do PWM2
	#define PWM1LER3_ENABLE			(1 << 3)							// Habilita o registrador latch do PWM3
	#define PWM1LER4_ENABLE			(1 << 4)							// Habilita o registrador latch do PWM4
	#define PWM1LER5_ENABLE			(1 << 5)							// Habilita o registrador latch do PWM5
	#define PWM1LER6_ENABLE			(1 << 6)							// Habilita o registrador latch do PWM6

