andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
	// MESTRE - RECEPÇÃO
	#define I2C2_MR_ARB_LOST				0x38
	#define I2C2_MR_SLA_ACK					0x40
	#define I2C2_MR_SLA_NACK				0x48
	#define I2C2_MR_DATA_ACK				0x50
	#define I2C2_MR_DATA_NACK				0x58

	// ESCRAVO Slave - TRANSMISSÃO
	#define I2C2_ST_SLA_ACK					0xA8
	#define I2C2_ST_ARB_LOST_SLA_ACK		0xB0
	#define I2C2_ST_DATA_ACK				0xB8
	#define I2C2_ST_DATA_NACK				0xC0
	#define I2C2_ST_LAST_DATA				0xC8

	// ESCRAVO - RECEPÇÃO
	#define I2C2_SR_SLA_ACK					0x60
	#define I2C2_SR_ARB_LOST_SLA_ACK		0x68
	#define I2C2_SR_GCALL_ACK				0x70
	#define I2C2_SR_ARB_LOST_GCALL_ACK		0x78
	#define I2C2_SR_DATA_ACK				0x80
	#define I2C2_SR_DATA_NACK				0x88
	#define I2C2_SR_GCALL_DATA_ACK			0x90
	#define I2C2_SR_GCALL_DATA_NACK			0x98
	#define I2C2_SR_STOP					0xA0

#define I2C2DAT         (*(reg32 *)(I2C2_BASE_ADDR + 0x08))
#define I2C2ADR         (*(reg32 *)(I2C2_BASE_ADDR + 0x0C))
#define I2C2SCLH        (*(reg32 *)(I2C2_BASE_ADDR + 0x10))
#define I2C2SCLL        (*(reg32 *)(I2C2_BASE_ADDR + 0x14))
#define I2C2CONCLR      (*(reg32 *)(I2C2_BASE_ADDR + 0x18))
	#define I2C2_AAC				(1 << 2) 					// ACK - Este bit em 1 envia um ACK em 0. bit 0 não tem efeito
  	#define I2C2_SIC				(1 << 3) 					// Flag de interrupção - Este bit em 1 limpa o flag de interrupção
  	#define I2C2_STAC				(1 << 5) 					// Este bit em 1 encerra o start. bit 0 não tem efeito
  	#define I2C2_I2ENC				(1 << 6) 					// Este bit em 1 desabilita bus I2C. bit 0 não tem efeito


// ########################################################################################################################################
// SSP0
#define SSP0_FIFO_DEPTH  (8)

#define SSP0_BASE_ADDR		0x40088000
#define SSP0CR0        (*(reg32 *)(SSP0_BASE_ADDR + 0x00))
	#define SSP0_DSS_4   (0x3)	// 4 bits de transferencia
	#define SSP0_DSS_5   (0x4)	// 5 bits de transferencia
	#define SSP0_DSS_6   (0x5)	// 6 bits de transferencia
	#define SSP0_DSS_7   (0x6)	// 7 bits de transferencia
	#define SSP0_DSS_8   (0x7)	// 8 bits de transferencia
	#define SSP0_DSS_9   (0x8)	// 9 bits de transferencia
	#define SSP0_DSS_10  (0x9)	// 10 bits de transferencia
	#define SSP0_DSS_11  (0xa)	// 11 bits de transferencia
	#define SSP0_DSS_12  (0xb)	// 12 bits de transferencia
	#define SSP0_DSS_13  (0xc)	// 13 bits de transferencia
	#define SSP0_DSS_14  (0xd)	// 14 bits de transferencia
	#define SSP0_DSS_15  (0xe)	// 15 bits de transferencia
	#define SSP0_DSS_16  (0xf)	// 16 bits de transferencia
		#define SSP0_DSS_MASK (0xf)
	#define SSP0_FRF_SPI (0x0)	// Formato frame = SPI
	#define SSP0_FRF_SSI (0x10)	// Formato frame = TI
	#define SSP0_FRF_MW  (0x20)	// Formato frame = Microwire
	#define SSP0_CPOL_L  (0)	// Clock em baixa entre os frames
	#define SSP0_CPOL_H  (1<<6)	// Clock em alta entre os frames
	#define SSP0_CPHA_L  (0)	// Dados capturados a partir do primeiro clock
	#define SSP0_CPHA_H  (1<<7)	// Dados capturados a partir do segundo clock

	#define SSP0_STANDARD (0x7)

#define SSP0CR1        (*(reg32 *)(SSP0_BASE_ADDR + 0x04))
	#define SSP0_LBM_NORMAL    	(0x0)	// Loop back mode normal operation
	#define SSP0_LBM_SOUT    	(0x1)	// Loop back mode pego da saida MISO ou MOSI
	#define SSP0_SSE_OFF   		(0x0)	// SSP enable. O controlador SSP é desabilitado
	#define SSP0_SSE_ON    		(0x2)	// SSP enable. O controlador SSP interage com outros dispositivos seriais
	#define SSP0_MASTER    		(0x0) 	// SSP como mestre
	#define SSP0_SLAVE     		(0x4)	// SSP como escravo
	#define SSP0_SOD     		(0x8)	// Somente usados para modo escravo.

#define SSP0DR         (*(reg32 *)(SSP0_BASE_ADDR + 0x08)) // Regitrador de leitura e escrita dados transferidos no barramento SPP

#define SSP0SR         (*(reg32 *)(SSP0_BASE_ADDR + 0x0C)) // Registrador de estatus
	#define SSP0_TFE      (0x00000001)	// 1 = FIFO TX = vazio
	#define SSP0_TNF      (0x00000002)	// 1 = FIFO TX não está cheio. 0 = FIFO TX está cheio
	#define SSP0_RNE      (0x00000004)	// 0 = FIFO RX está vazio
	#define SSP0_RFF      (0x00000008)	// 1 = FIFO RX não está cheio
	#define SSP0_BSY      (0x00000010)	// 0 = BUS oscioso. 1 = BUS TX ou RX

#define SSP0CPSR       (*(reg32 *)(SSP0_BASE_ADDR + 0x10))

#define SSP0IMSC       (*(reg32 *)(SSP0_BASE_ADDR + 0x14))
	#define SSP0_RORIM  (0x1)
	#define SSP0_RTIM   (0x2)
	#define SSP0_RXIM   (0x4)
	#define SSP0_TXIM   (0x8)

#define SSP0RIS        (*(reg32 *)(SSP0_BASE_ADDR + 0x18))
	#define SSP0_RORRIS  (0x00000001)
	#define SSP0_RTRIS   (0x00000002)
	#define SSP0_RXRIS   (0x00000004)
	#define SSP0_TXRIS   (0x00000008)

#define SSP0MIS        (*(reg32 *)(SSP0_BASE_ADDR + 0x1C))
	#define SSP0_RORMIS  (0x00000001)
	#define SSP0_RTMIS   (0x00000002)
	#define SSP0_RXMIS   (0x00000004)
	#define SSP0_TXMIS   (0x00000008)

#define SSP0ICR        (*(reg32 *)(SSP0_BASE_ADDR + 0x20))
	#define SSP0_RORIC   (0x00000001)
	#define SSP0_RTIC    (0x00000002)

#define SSP0DMACR      (*(reg32 *)(SSP0_BASE_ADDR + 0x24))

// ########################################################################################################################################
// SSP1 Controller
#define SSP1_FIFO_DEPTH  (8)

#define SSP1_BASE_ADDR		0x40030000
#define SSP1CR0        (*(reg32 *)(SSP1_BASE_ADDR + 0x00))
	#define SSP1_DSS_4   (0x3)	// 4 bits de transferencia
	#define SSP1_DSS_5   (0x4)	// 5 bits de transferencia
	#define SSP1_DSS_6   (0x5)	// 6 bits de transferencia
	#define SSP1_DSS_7   (0x6)	// 7 bits de transferencia
	#define SSP1_DSS_8   (0x7)	// 8 bits de transferencia
	#define SSP1_DSS_9   (0x8)	// 9 bits de transferencia
	#define SSP1_DSS_10  (0x9)	// 10 bits de transferencia
	#define SSP1_DSS_11  (0xa)	// 11 bits de transferencia
	#define SSP1_DSS_12  (0xb)	// 12 bits de transferencia
	#define SSP1_DSS_13  (0xc)	// 13 bits de transferencia
	#define SSP1_DSS_14  (0xd)	// 14 bits de transferencia
	#define SSP1_DSS_15  (0xe)	// 15 bits de transferencia
	#define SSP1_DSS_16  (0xf)	// 16 bits de transferencia
		#define SSP1_DSS_MASK (0xf)
	#define SSP1_FRF_SPI (0x0)	// Formato frame = SPI
	#define SSP1_FRF_SSI (0x10)	// Formato frame = TI
	#define SSP1_FRF_MW  (0x20)	// Formato frame = Microwire
	#define SSP1_CPOL_L  (0)	// Clock em baixa entre os frames
	#define SSP1_CPOL_H  (1<<6)	// Clock em alta entre os frames
	#define SSP1_CPHA_L  (0)	// Dados capturados a partir do primeiro clock
	#define SSP1_CPHA_H  (1<<7)	// Dados capturados a partir do segundo clock
	#define SSP1_STANDARD (0x7)

