andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#define SSP1CR1        (*(reg32 *)(SSP1_BASE_ADDR + 0x04))
	#define SSP1_LBM_NORMAL    	(0x0)	// Loop back mode normal operation
	#define SSP1_LBM_SOUT    	(0x1)	// Loop back mode pego da saida MISO ou MOSI
	#define SSP1_SSE_OFF   		(0x0)	// SSP enable. O controlador SSP é desabilitado
	#define SSP1_SSE_ON    		(0x2)	// SSP enable. O controlador SSP interage com outros dispositivos seriais
	#define SSP1_MASTER    		(0x0) 	// SSP como mestre
	#define SSP1_SLAVE     		(0x4)	// SSP como escravo
	#define SSP1_SOD     		(0x8)	// Somente usados para modo escravo.

#define SSP1DR         (*(reg32 *)(SSP1_BASE_ADDR + 0x08))

#define SSP1SR         (*(reg32 *)(SSP1_BASE_ADDR + 0x0C))
	#define SSP1_TFE      (0x00000001)	// 1 = FIFO TX = vazio
	#define SSP1_TNF      (0x00000002)	// 1 = FIFO TX não está cheio. 0 = FIFO TX está cheio
	#define SSP1_RNE      (0x00000004)	// 0 = FIFO RX está vazio
	#define SSP1_RFF      (0x00000008)	// 1 = FIFO RX não está cheio
	#define SSP1_BSY      (0x00000010)	// 0 = BUS oscioso. 1 = BUS TX ou RX

#define SSP1CPSR       (*(reg32 *)(SSP1_BASE_ADDR + 0x10))

#define SSP1IMSC       (*(reg32 *)(SSP1_BASE_ADDR + 0x14))
	#define SSP1_RORIM  (0x1)
	#define SSP1_RTIM   (0x2)
	#define SSP1_RXIM   (0x4)
	#define SSP1_TXIM   (0x8)

#define SSP1RIS        (*(reg32 *)(SSP1_BASE_ADDR + 0x18))
	#define SSP1_RORRIS  (0x00000001)
	#define SSP1_RTRIS   (0x00000002)
	#define SSP1_RXRIS   (0x00000004)
	#define SSP1_TXRIS   (0x00000008)

#define SSP1MIS        (*(reg32 *)(SSP1_BASE_ADDR + 0x1C))
	#define SSP1_RORMIS  (0x00000001)
	#define SSP1_RTMIS   (0x00000002)
	#define SSP1_RXMIS   (0x00000004)
	#define SSP1_TXMIS   (0x00000008)

#define SSP1ICR        (*(reg32 *)(SSP1_BASE_ADDR + 0x20))
	#define SSP1_RORIC   (0x00000001)
	#define SSP1_RTIC    (0x00000002)

#define SSP1DMACR      (*(reg32 *)(SSP1_BASE_ADDR + 0x24))

// ########################################################################################################################################
// RTC - REAL TIME CLOCK RTC
#define RTC_BASE_ADDR		0x40024000

#define ILR         	(*(reg32 *)(RTC_BASE_ADDR + 0x00))      // Interrupt Location Register
	#define RTCCIF 		(1 << 0) 									// Quando 1 o bloco do timer RTC gera uma interrupção. Escrevendo 1 limpa interrupção
	#define RTCALF		(1 << 1)									// Quando 1 o bloco do alarme gera uma interrupção. Escrevendo 1 limpa interrupção

#define CCR         	(*(reg32 *)(RTC_BASE_ADDR + 0x08))      // Clock Control Register
	#define CLKEN		(1 << 0)									// habilita Clock
	#define CTCRST		(1 << 1)									// Quando em 1 mantém em reset
	#define CCALEN		(1 << 4)									// Calibration counter enable

#define CIIR        	(*(reg32 *)(RTC_BASE_ADDR + 0x0C))      // Counter Increment Interrupt Register
	#define IMNO		(0)			// Nenhum parametro será usado
  	#define IMSEC		(1 << 0)	// Este bit em 1, quando ocorrer o incremento no valor do segundo, gera interrupção
  	#define IMMIN		(1 << 1)	// Este bit em 1, quando ocorrer o incremento no valor do minuto, gera interrupção
  	#define IMHOUR		(1 << 2)	// Este bit em 1, quando ocorrer o incremento no valor do hora, gera interrupção
  	#define IMDOM		(1 << 3)	// Este bit em 1, quando ocorrer o incremento no valor do dia dos mês, gera interrupção
  	#define IMDOW		(1 << 4)	// Este bit em 1, quando ocorrer o incremento no valor do dia da semana, gera interrupção
  	#define IMDOY		(1 << 5)	// Este bit em 1, quando ocorrer o incremento no valor do do ano, gera interrupção
  	#define IMMON		(1 << 6)	// Este bit em 1, quando ocorrer o incremento no valor do mês, gera interrupção
  	#define IMYEAR		(1 << 7)	// Este bit em 1, quando ocorrer o incremento no valor do ano, gera interrupção

#define AMR         	(*(reg32 *)(RTC_BASE_ADDR + 0x10))      // Alarm Mask Register
	#define AMRNO		(0)											// Nenhum parametro será usado
	#define AMRSEC		(1 << 0)									// Este bit em 1, o valor do segundo não é usado para gerar o alarme
	#define AMRMIN		(1 << 1)									// Este bit em 1, o valor do minuto não é usado para gerar o alarme
	#define AMRHOUR		(1 << 2)									// Este bit em 1, o valor do hora não é usado para gerar o alarme
	#define AMRDOM		(1 << 3)									// Este bit em 1, o valor do dia dos mês não é usado para gerar o alarme
	#define AMRDOW		(1 << 4)									// Este bit em 1, o valor do dia da semana não é usado para gerar o alarme
	#define AMRDOY		(1 << 5)									// Este bit em 1, o valor do do ano não é usado para gerar o alarme
	#define AMRMON		(1 << 6)									// Este bit em 1, o valor do mês não é usado para gerar o alarme
	#define AMRYEAR		(1 << 7)									// Este bit em 1, o valor do ano não é usado para gerar o alarme
	#define AMRMASK		(0xFF)

// REGISTRADORES DE CONTAGEM DE TEMPO
#define CTIME0    	  	(*(reg32 *)(RTC_BASE_ADDR + 0x14))     	// Consolidated Time Register 0
#define CTIME1    	  	(*(reg32 *)(RTC_BASE_ADDR + 0x18))     	// Consolidated Time Register 1
#define CTIME2    	  	(*(reg32 *)(RTC_BASE_ADDR + 0x1C))     	// Consolidated Time Register 2

// REGISTRADORES DO TEMPO ATUAL
#define SEC         	(*(reg32 *)(RTC_BASE_ADDR + 0x20))      // Seconds Register
#define MIN         	(*(reg32 *)(RTC_BASE_ADDR + 0x24))      // Minutes Register
#define HOUR        	(*(reg32 *)(RTC_BASE_ADDR + 0x28))      // Hours Register
#define DOM         	(*(reg32 *)(RTC_BASE_ADDR + 0x2C))      // Day Of Month Register
#define DOW         	(*(reg32 *)(RTC_BASE_ADDR + 0x30))      // Day Of Week Register
#define DOY         	(*(reg32 *)(RTC_BASE_ADDR + 0x34))      // Day Of Year Register
#define MONTH  	    	(*(reg32 *)(RTC_BASE_ADDR + 0x38))      // Months Register
#define YEAR   	    	(*(reg32 *)(RTC_BASE_ADDR + 0x3C))      // Years Register
#define CALIBRATION    	(*(reg32 *)(RTC_BASE_ADDR + 0x40))

// REGISTRADORES PARA O ALARME
#define ALSEC       	(*(reg32 *)(RTC_BASE_ADDR + 0x60))      // Alarm Seconds Register
#define ALMIN       	(*(reg32 *)(RTC_BASE_ADDR + 0x64))      // Alarm Minutes Register
#define ALHOUR      	(*(reg32 *)(RTC_BASE_ADDR + 0x68))      // Alarm Hours Register
#define ALDOM       	(*(reg32 *)(RTC_BASE_ADDR + 0x6C))      // Alarm Day Of Month Register
#define ALDOW       	(*(reg32 *)(RTC_BASE_ADDR + 0x70))      // Alarm Day Of Week Register
#define ALDOY       	(*(reg32 *)(RTC_BASE_ADDR + 0x74))      // Alarm Day Of Year Register
#define ALMON       	(*(reg32 *)(RTC_BASE_ADDR + 0x78))      // Alarm Months Register
#define ALYEAR   	   	(*(reg32 *)(RTC_BASE_ADDR + 0x7C))      // Alarm Years Register

//// REGISTRADORES PARA CONTROLE DO RTC ATRAVÉS DO CLOCK DA CPU
//#define PREINT      	(*(reg32 *)(RTC_BASE_ADDR + 0x80))    	// Prescale Value Register (integer)
//#define PREFRAC     	(*(reg32 *)(RTC_BASE_ADDR + 0x84))    	// Prescale Value Register (fraction)

// ########################################################################################################################################
// BLOCOS DE CONEXÃO DE PINOS IO
// datasheet pagina 113
#define PINSEL_BASE_ADDR	0x4002C000

#define PINSEL0        (*(reg32 *)(PINSEL_BASE_ADDR + 0x00))
#define PINSEL1        (*(reg32 *)(PINSEL_BASE_ADDR + 0x04))
#define PINSEL2        (*(reg32 *)(PINSEL_BASE_ADDR + 0x08))
#define PINSEL3        (*(reg32 *)(PINSEL_BASE_ADDR + 0x0C))
#define PINSEL4        (*(reg32 *)(PINSEL_BASE_ADDR + 0x10))
#define PINSEL7        (*(reg32 *)(PINSEL_BASE_ADDR + 0x1C))
#define PINSEL9        (*(reg32 *)(PINSEL_BASE_ADDR + 0x24))
#define PINSEL10       (*(reg32 *)(PINSEL_BASE_ADDR + 0x28))

