andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#define PINMODE0        (*(reg32 *)(PINSEL_BASE_ADDR + 0x40))	// Configuração de pullup (00 padrão)/repetidor(01)/nem pullup e nem oulldown (10)/pulldown(11)
#define PINMODE1        (*(reg32 *)(PINSEL_BASE_ADDR + 0x44)) 	// Idem acima
#define PINMODE2        (*(reg32 *)(PINSEL_BASE_ADDR + 0x48))	// Idem acima
#define PINMODE3        (*(reg32 *)(PINSEL_BASE_ADDR + 0x4C))	// Idem acima
#define PINMODE4        (*(reg32 *)(PINSEL_BASE_ADDR + 0x50))	// Idem acima
#define PINMODE7        (*(reg32 *)(PINSEL_BASE_ADDR + 0x5C))	// Idem acima
#define PINMODE9        (*(reg32 *)(PINSEL_BASE_ADDR + 0x64))	// Idem acima

#define PINMODE_OD0     (*(reg32 *)(PINSEL_BASE_ADDR + 0x68))	// normal, não dreno aberto (0 padrão) / Dreno aberto (1)
#define PINMODE_OD1     (*(reg32 *)(PINSEL_BASE_ADDR + 0x6C))	// Idem acima
#define PINMODE_OD2     (*(reg32 *)(PINSEL_BASE_ADDR + 0x70))	// Idem acima
#define PINMODE_OD3     (*(reg32 *)(PINSEL_BASE_ADDR + 0x74))	// Idem acima
#define PINMODE_OD4     (*(reg32 *)(PINSEL_BASE_ADDR + 0x78))	// Idem acima


// ########################################################################################################################################
// ADC0
#define AD0_BASE_ADDR		0x40034000

#define AD0CR          (*(reg32 *)(AD0_BASE_ADDR + 0x00))
  	#define AD0_CHANNEL0		0
	#define AD0_CHANNEL1		1
	#define AD0_CHANNEL2		2
	#define AD0_CHANNEL3		3
	#define AD0_CHANNEL4		4
	#define AD0_CHANNEL5		5
	#define AD0_CHANNEL6		6
	#define AD0_CHANNEL7		7
	#define AD0_CHANNEL_MASK	(0xFF)

  	#define AD0_STOPPED 		( 0 << 24 )						// Somente no modo não BUSRT. Conversor parado
  	#define AD0_START_NOW		( 1 << 24 )						// Somente no modo não BUSRT. Incializa conversçao agora
  	#define AD0_START_MAT0_0 	( 3 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.0
  	#define AD0_START_MAT0_1 	( 4 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.1
  	#define AD0_START_MAT0_2 	( 2 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.2
  	#define AD0_START_MAT0_3 	( 5 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.3
  	#define AD0_START_MAT1_0 	( 6 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT1.0
  	#define AD0_START_MAT1_1 	( 7 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT1.1
  	#define AD0_START_MASK		( 7 << 24 )

  	#define AD0_EDGE_FALLING 	( 0 << 27 )						// Começa a captura na borda de descrida do gatilho
  	#define AD0_EDGE_RISING		( 1 << 27 )						// Começa a captura na borda de subida do gatilho
  	#define AD0_EDGE_MASK		( 1 << 27 )

  	#define AD0_BUSRT			( 1 << 16)

#define AD0GDR         (*(reg32 *)(AD0_BASE_ADDR + 0x04))
#define AD0INTEN       (*(reg32 *)(AD0_BASE_ADDR + 0x0C))

#define AD0DR0         (*(reg32 *)(AD0_BASE_ADDR + 0x10))
#define AD0DR1         (*(reg32 *)(AD0_BASE_ADDR + 0x14))
#define AD0DR2         (*(reg32 *)(AD0_BASE_ADDR + 0x18))
#define AD0DR3         (*(reg32 *)(AD0_BASE_ADDR + 0x1C))
#define AD0DR4         (*(reg32 *)(AD0_BASE_ADDR + 0x20))
#define AD0DR5         (*(reg32 *)(AD0_BASE_ADDR + 0x24))
#define AD0DR6         (*(reg32 *)(AD0_BASE_ADDR + 0x28))
#define AD0DR7         (*(reg32 *)(AD0_BASE_ADDR + 0x2C))
  	#define AD0_DONE		( 1 << 31 ) 				// Sinaliza quando a conversão ADC esteja completa
  	#define AD0_OVERUN		( 1 << 30 )					// Sinaliza quando os dados de uma ou mais conversções foram perdidos no modo busrt

#define AD0STAT        (*(reg32 *)(AD0_BASE_ADDR + 0x30))
  	// AD0STAT[7:0] Sinaliza o canal que a conversão foi concluida
  	#define AD0_CHANNEL0_DONE		(1 << 0)
	#define AD0_CHANNEL1_DONE		(1 << 1)
	#define AD0_CHANNEL2_DONE		(1 << 2)
	#define AD0_CHANNEL3_DONE		(1 << 3)
	#define AD0_CHANNEL4_DONE		(1 << 4)
	#define AD0_CHANNEL5_DONE		(1 << 5)
	#define AD0_CHANNEL6_DONE		(1 << 6)
	#define AD0_CHANNEL7_DONE		(1 << 7)
	#define AD0_CHANNEL_DONE_MASK	0xFF

  	// AD0STAT[15:8] Sinaliza o canal que a houve overrum no modo burst
  	#define AD0_CHANNEL0_OVERUN	(1 << 8)
	#define AD0_CHANNEL1_OVERUN		(1 << 9)
	#define AD0_CHANNEL2_OVERUN		(1 << 10)
	#define AD0_CHANNEL3_OVERUN		(1 << 11)
	#define AD0_CHANNEL4_OVERUN		(1 << 12)
	#define AD0_CHANNEL5_OVERUN		(1 << 13)
	#define AD0_CHANNEL6_OVERUN		(1 << 14)
	#define AD0_CHANNEL7_OVERUN		(1 << 15)
	#define AD0_CHANNEL_OVERUN_MASK	0xFF00

#define AD0TRM        (*(reg32 *)(AD0_BASE_ADDR + 0x34))


// ########################################################################################################################################
// DAC
#define DAC_BASE_ADDR	0x4008C000
#define DACR           	(*(reg32 *)(DAC_BASE_ADDR + 0x00))
	#define DACR_VALUE_MASK  	(0x0000ffc0)
	#define DACR_VALUE_SHIFT 	(6)
	#define DACR_BIAS       	(0x00010000)
	#define DACR_MASK        	(0x0001ffc0)
#define DACCTRL        	(*(reg32 *)(DAC_BASE_ADDR + 0x04))
#define DACCNTVAL      	(*(reg32 *)(DAC_BASE_ADDR + 0x08))

// ########################################################################################################################################
// BLOCO DE CONTROLE DO SISTEMA (SCB - System Control Block)
#define SCS_BASE_ADDR	0x400FC000
#define VTOR *((reg32*) 0xE000ED08) // Define em que região de memória o vetor de ints ficarão
	#define vtor_SetInCode(addr) {VTOR = addr;}
	#define vtor_SetInSram(addr) {VTOR = 0x20000000 | addr;}

#define FLASHCFG       (*(reg32 *)(SCS_BASE_ADDR + 0x000))		// Flash Accelerator Configuration Register
	#define FLASHTIM_20MHZ 0		// Flash accesses use 1 CPU clock. Use for up to 20 MHz CPU clock with power boost off
	#define FLASHTIM_40MHZ (1<<12)	// Flash accesses use 2 CPU clocks. Use for up to 40 MHz CPU clock with power boost off
	#define FLASHTIM_60MHZ (2<<12) 	// Flash accesses use 3 CPU clocks. Use for up to 60 MHz CPU clock with power boost off
	#define FLASHTIM_80MHZ (3<<12)	// Flash accesses use 4 CPU clocks. Use for up to 80 MHz CPU clock with power boost off
									//	Use this setting for operation from 100 to 120 MHz operation with power boost on
	#define FLASHTIM_100MHZ (4<<12)	// Flash accesses use 5 CPU clocks. Use for up to 100 MHz CPU clock with power boost off
	#define FLASHTIM_SAFE 	(5<<12)	// Flash accesses use 6 CPU clocks. “Safe” setting for any allowed conditions
	#define FLASHTIM_AUTO 	(6<<12)	// Configura a velocidade da FLASH automaticamente


// REGISTRADORES PARA TRAVA DE PLL
// PLLCON = PLL0CON
#define PLLCON         (*(reg32 *)(SCS_BASE_ADDR + 0x080))		// Registrador de controle do PLL
#define PLL1CON         (*(reg32 *)(SCS_BASE_ADDR + 0x0A0))		// Registrador de controle do PLL1
	#define PLLCON_PLLE   (1 << 0)          					// 1 Habilita PLL / 0 - desabilita PLL
	#define PLLCON_PLLC   (1 << 1)          					// 1 Conecta PLL após de habilitado e travado / 0 - desconecta PLL
	#define pll_OFF()		{ PLLCON = 0; }
	#define pll_ON()		{ PLLCON |= 1; }
	#define pll_Connect()	{ PLLCON |= 2; }
	#define pll1_OFF()		{ PLL1CON = 0; }
	#define pll1_ON()		{ PLL1CON |= 1; }
	#define pll1_Connect()	{ PLL1CON |= 2; }

