andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
// PLLCFG = PLL0CFG
#define PLLCFG         (*(reg32 *)(SCS_BASE_ADDR + 0x084))		// Registrador de multiplicação e dvisão do PLL0
#define PLL1CFG         (*(reg32 *)(SCS_BASE_ADDR + 0x0A4))		// Registrador de multiplicação e dvisão do PLL1

// PLLSTAT = PLL0STAT
#define PLLSTAT        (*(reg32 *)(SCS_BASE_ADDR + 0x088))		// Registrador de Status
#define PLL1STAT       (*(reg32 *)(SCS_BASE_ADDR + 0x0A8))		// Registrador de Status
	#define PLLSTAT_PLLE  (1 << 24)									// Bit indicador se o PLL está ou não ativado
	#define PLLSTAT_PLLC  (1 << 25)         						// Bit de status de conexão do PLL
	#define PLLSTAT_LOCK  (1 << 26)         						// Bit de status de travamento do PLL
	#define PLL1STAT_PLLE  (1 << 8)									// Bit indicador se o PLL está ou não ativado
	#define PLL1STAT_PLLC  (1 << 9)         						// Bit de status de conexão do PLL
	#define PLL1STAT_LOCK  (1 << 10)         						// Bit de status de travamento do PLL

// PLLFEED = PLL0FEED
#define PLLFEED        (*(reg32 *)(SCS_BASE_ADDR + 0x08C))		// Registrador de validação de mudança do PLL
#define PLL1FEED       (*(reg32 *)(SCS_BASE_ADDR + 0x0AC))		// Registrador de validação de mudança do PLL1

// REGISTRADOR DE CONTROLE DE CONSUMO (POWER CONTROL datasheet pg 59)
#define PCON           (*(reg32 *)(SCS_BASE_ADDR + 0x0C0))		// Registrador de controle de potencia
#define PCONP          (*(reg32 *)(SCS_BASE_ADDR + 0x0C4))		// Registrador de controle de potencia dos perifericos
	#define PCTIM0			(1 << 1)	// Timer/Counter 0 power/clock control bit. Reset = 1
	#define PCTIM1		 	(1 << 2)	// Timer/Counter 1 power/clock control bit. Reset = 1
	#define PCUART0		 	(1 << 3)	// UART0 power/clock control bit. Reset = 1
	#define PCUART1 		(1 << 4)	// UART1 power/clock control bit. Reset = 1

	#define PCPWM1 		 	(1 << 6)	// PWM1 power/clock control bit. Reset = 0
	#define PCI2C0 		 	(1 << 7)	// The I2C0 interface power/clock control bit. Reset = 1
	#define PCSPI		 	(1 << 8)	// UART0 power/clock control bit. Reset = 0
	#define PCRTC 			(1 << 9)	// The RTC power/clock control bit. Reset = 1
	#define PCSSP1 			(1 << 10)	// The SSP1 interface power/clock control bit. Reset = 0

	#define PCAD 		 	(1 << 12)	// A/D converter (ADC) power/clock control bit. Reset = 0
	#define PCCAN1 		 	(1 << 13)	// CAN Controller 1 power/clock control bit. Reset = 0
	#define PCCAN2 			(1 << 14)	// CAN Controller 2 power/clock control bit. Reset = 0
	#define PCGPIO 			(1 << 15)	// Power/clock control bit for IOCON, GPIO, and GPIO interrup. Reset = 1
	#define PCMCPWM 		(1 << 17)	// Motor Control PWM power/clock control bit. Reset = 0
	#define PCQEI   		(1 << 18)	// Quadrature Encoder Interface power/clock control bit. Reset = 0
	#define PCI2C1 			(1 << 19)	// The I2C1 interface power/clock control bit. Reset = 1

	#define PCSSP0 	 	 	(1 << 21)	// SSP0 interface power/clock control bit. Reset = 0
	#define PCTIM2 			(1 << 22)	// Timer 2 power/clock control bit. Reset = 0
	#define PCTIM3 			(1 << 23)	// Timer 3 power/clock control bit. Reset = 0
	#define PCUART2 		(1 << 24)	// UART 2 power/clock control bit. Reset = 0
	#define PCUART3 		(1 << 25)	// UART 3 power/clock control bit. Reset = 0
	#define PCI2C2 			(1 << 26)	// I2S interface 2 power/clock control bit.  Reset = 1
	#define PCI2S 			(1 << 27)	// I2S interface power/clock control bit. Reset = 0

	#define PCGPDMA  		(1 << 29)	// GP DMA function power/clock control bit.  Reset = 0
	#define PCUSB 			(1 << 31)	// USB interface power/clock control bit.  Reset = 0

// REGISTRADOR DIVISÃO DE CLOCK
#define CLKSRCSEL     	(*(reg32 *)(SCS_BASE_ADDR + 0x10C))		// Registrador para selecionar o tipo de oscilador para o PLL
	#define clksrcsel_oscRC() 		{ CLKSRCSEL = 0; }
	#define clksrcsel_oscMAIN() 	{ CLKSRCSEL = 1; }
	#define clksrcsel_oscRTC() 		{ CLKSRCSEL = 2; }
#define CCLKCFG     	(*(reg32 *)(SCS_BASE_ADDR + 0x104))		// CPU Clock Selection register
	#define cclksel_clkDiv(div) { CCLKCFG = (CCLKCFG & (~(0xff))) | ((div-1ul)&0xff); }
#define USBCLKCFG		(*(reg32 *)(SCS_BASE_ADDR + 0x108))		// Divisor do FCCO od PLL1 para a USB
	#define usbksel_clkDiv(div) { USBCLKCFG = (USBCLKCFG & (~(0xf))) | ((div-1ul)&0xf); }
#define PCLKSEL			(*(reg32 *)(SCS_BASE_ADDR + 0x1A8))		// Peripheral Clock Selection register
#define PCLKSEL1		(*(reg32 *)(SCS_BASE_ADDR + 0x1AC))		// Peripheral Clock Selection register

// INDENTIFICAÇÃO DE ORIGEM DO RESET
#define RSID           (*(reg32 *)(SCS_BASE_ADDR + 0x180))

// CONTROLE E STATUS DO SISTEMA
#define SCS            (*(reg32 *)(SCS_BASE_ADDR + 0x1A0))
	#define SCS_OSCRANGE_1MHZ_20MHZ		0x0					// Define que o a frequencia de entrada do clock para o oscilador principal está na faixa de 1MHZ a 20MHZ
	#define SCS_OSCRANGE_15MHZ_25MHZ	0x10				// Define que o a frequencia de entrada do clock para o oscilador principal está na faixa de 15MHZ a 25MHZ
	#define SCS_OSCEN					(1 << 5)			// Bit para ligar o oscilador principal
	#define SCS_OSCSTAT					(1 << 6)			// Bit para verificar se o oscilador principal está pronto para uso
	#define scs_oscOFF()				{SCS &= ~(1ul<<5); }
	#define scs_oscON()					{SCS |= (1ul<<5); }


// VALORES PADRÕES DE SEGURANÇA DE ERROS DE CONFIGURAÇÃO
#if defined(OSC_XTAL)
#define F_CPU_MIN 			1000000 	// 10MHz
#define F_CPU_MAX 			25000000	// 25MHz
#else
#define F_CPU_MIN 			4000000		// 4MHz
#define F_CPU_MAX 			4000000		// 4MHz
#endif

#define CCLK_MIN			10000000	// 10MHz
#define CCLK_MAX			100000000	// 100MHz
#define FCCO_MIN			275000000	// 275MHz
#define FCCO_MAX			550000000	// 550MHz

#define PLL_M_MIN			5
#define PLL_M_MAX			511
#define PLL_N_MIN			0
#define PLL_N_MAX			255

#define PLL1_M_MIN			0
#define PLL1_M_MAX			31

// ########################################################################################################################################
// EINT - REGISTRADORES DE INTERRUPÇÕES EXTERNAS

#define EINT0					0x1			// Interrupção externa 0
#define EINT1					0x2			// Interrupção externa 1
#define EINT2					0x4			// Interrupção externa 2
#define EINT3					0x8			// Interrupção externa 3
//
#define EXTINT         (*(reg32 *)(0x400FC140))
   	// 	X		X		X		X 	EINT3 	EINT2 	EINT1 	EINT0
   		// Escrever 1 limpa o flag de interrupção

#define EXTMODE        (*(reg32 *)(0x400FC148))
   	// 	X		X		X		X 	EINT3 	EINT2 	EINT1 	EINT0
	// EXTMODE - Modo de trigger de interrupção
	#define EXTMODE_LEVEL 		0 			// Sensivel ao nivel do sinal
	#define EXTMODE_EDGE 		1 			// Sensivel a borda do sinal

