andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#define EXTPOLAR       (*(reg32 *)(0x400FC14C))
    // 	X		X		X		X 	EINT3 	EINT2 	EINT1 	EINT0
	// EXTPOLAR - Polaridade da sensibilidade da interrupção
	#define EXTPOLAR_LOW 		0			// Sensivel ao nivel baixo ou na queda do sinal
	#define EXTPOLAR_HIGH 		1			// Sensivel ao nivel alto ou na subida do sinal

// ########################################################################################################################################
// VECTORED INTERRUPT CONTROLLER

#define VIC_BASE_ADDR		0xE000E000

// ANEXOS PARA CANAIS NVIC para core ARM
#define VIC_MEMORYMANAGEMENT          -12      //!< 4 Cortex-M3 Memory Management Interrupt
#define VIC_BUSFAULT                  -11      //!< 5 Cortex-M3 Bus Fault Interrupt
#define VIC_USAGEFAULT                -10      //!< 6 Cortex-M3 Usage Fault Interrupt
#define VIC_SVCALL                    -5       //!< 11 Cortex-M3 SV Call Interrupt
#define VIC_PENDSV                    -2       //!< 14 Cortex-M3 Pend SV Interrupt
#define VIC_SYSTICK                   -1       //!< 15 Cortex-M3 System Tick Interrupt

#define SHPR1   (*(reg32 *)(VIC_BASE_ADDR + 0xD18))
#define SHPR2   (*(reg32 *)(VIC_BASE_ADDR + 0xD1C))
#define SHPR3   (*(reg32 *)(VIC_BASE_ADDR + 0xD20))

// ANEXOS PARA CANAIS NVIC para os periféricos. página 71
#define VIC_WDT         0 	// Interrupção watchdog
#define VIC_TIMER0      1 	// Interrupção Timer 0
#define VIC_TIMER1      2	// Interrupção Timer 1
#define VIC_TIMER2      3 	// Interrupção Timer 2
#define VIC_TIMER3      4	// Interrupção Timer 3
#define VIC_UART0       5	// Interrupção UART 0
#define VIC_UART1       6	// Interrupção UART 1
#define VIC_UART2		7	// Interrupção UART 2
#define VIC_UART3		8	// Interrupção UART 3
#define VIC_PWM1       	9	// Interrupção PWM 1
#define VIC_I2C0        10	// Interrupção I2C 0
#define VIC_I2C1        11	// Interrupção I2C 1
#define VIC_I2C2        12	// Interrupção I2C 2
#define VIC_SPI			13	// Interrupção SPI
#define VIC_SSP0		14	// Interrupção SSP 0
#define VIC_SSP1		15	// Interrupção SSP 1
#define VIC_PLL0		16	// Interrupção PLL 0 (MAIN)
#define VIC_RTC			17	// Interrupção RTC 0
#define VIC_EINT0		18	// Interrupção externa 0
#define VIC_EINT1		19	// Interrupção externa 1
#define VIC_EINT2		20	// Interrupção externa 2
#define VIC_EINT3		21	// Interrupção externa 3
#define VIC_ADC			22	// Interrupção ADC
#define VIC_BOD			23	// Interrupção detecção brown out
#define VIC_USB			24	// Interrupção USB
#define VIC_CAN			25	// Interrupção CAN
#define VIC_DMA			26	// Interrupção General Purpose DMA
#define VIC_I2S			27
#define VIC_ENET		28	// Interrupção Ethernet
#define VIC_RITINT		29  // Repetitive InterruptTimer
#define VIC_MCPWM		30	// Interrupção Motor Control PWM
#define VIC_QEI			31	// Interrupção Quadrature Encoder Interface
#define VIC_PLL1		32	// Interrupção PLL1 Lock (USB PLL)
#define VIC_USBACT		33	// Interrupção USB Activity interrupt
#define VIC_CANACT		34	// Interrupção CAN Activity interrupt

#define VIC_SIZE			32
#define VIC_PRIO_BITS       5         //!< Number of Bits used for Priority Levels

// REGISTRADORES PARA HABILITAR INTERRUPÇÕES
#define ISER0   (*(reg32 *)(VIC_BASE_ADDR + 0x100)) // Habilita interrupções
#define ISER1   (*(reg32 *)(VIC_BASE_ADDR + 0x104))

// REGISTRADORES PARA DESABILITAR INTERRUPÇÕES
#define ICER0   (*(reg32 *)(VIC_BASE_ADDR + 0x180))
#define ICER1   (*(reg32 *)(VIC_BASE_ADDR + 0x184))

// REGISTRADORES PARA FORÇAR A INTERRUPÇÃO PARA MODO PENDENTE
#define ISPR0   (*(reg32 *)(VIC_BASE_ADDR + 0x200))
#define ISPR1   (*(reg32 *)(VIC_BASE_ADDR + 0x204))

// REGISTRADORES PARA REMOVER AS INTERRUPÇÕES DO MODO DE PEDENCIAS
#define ICPR0   (*(reg32 *)(VIC_BASE_ADDR + 0x280))
#define ICPR1   (*(reg32 *)(VIC_BASE_ADDR + 0x284))

// REGISTRADORES PARA INIDCAR QUAL A INTERRUPÇÃO ESTÁ ATIVA - somente de leitura
#define IABR0   (*(reg32 *)(VIC_BASE_ADDR + 0x300))
#define IABR1   (*(reg32 *)(VIC_BASE_ADDR + 0x304))

// REGISTRADORES PARA AJUSTAR AS PRIORIDADES DAS INTERRUPÇÕES
#define IPR_BASE   (*(reg32 *)(VIC_BASE_ADDR + 0x400))

// REGISTRADOR PARA INTERRUPÇÃO POR SOFTWARE - somente de escrita
#define STIR   (*(reg32 *)(VIC_BASE_ADDR + 0xF00))

// ########################################################################################################################################
// SETUP FAST I/O datasheet pagina 122
// Usados quando a função do pino (IOCON) é 1 (GPIO)
#define FIO_BASE_ADDR		0x2009C000UL

// PORT 0 acesso 32 bits
#define FIO0DIR        	(*(reg32 *)(FIO_BASE_ADDR + 0x00))
#define FIO0MASK       	(*(reg32 *)(FIO_BASE_ADDR + 0x10))
#define FIO0PIN        	(*(reg32 *)(FIO_BASE_ADDR + 0x14))
#define FIO0SET        	(*(reg32 *)(FIO_BASE_ADDR + 0x18))
#define FIO0CLR        	(*(reg32 *)(FIO_BASE_ADDR + 0x1C))

// PORT 1 acesso 32 bits
#define FIO1DIR        (*(reg32 *)(FIO_BASE_ADDR + 0x20))
#define FIO1MASK       (*(reg32 *)(FIO_BASE_ADDR + 0x30))
#define FIO1PIN        (*(reg32 *)(FIO_BASE_ADDR + 0x34))
#define FIO1SET        (*(reg32 *)(FIO_BASE_ADDR + 0x38))
#define FIO1CLR        (*(reg32 *)(FIO_BASE_ADDR + 0x3C))

// PORT 2 acesso 32 bits
#define FIO2DIR        (*(reg32 *)(FIO_BASE_ADDR + 0x40))
#define FIO2MASK       (*(reg32 *)(FIO_BASE_ADDR + 0x50))
#define FIO2PIN        (*(reg32 *)(FIO_BASE_ADDR + 0x54))
#define FIO2SET        (*(reg32 *)(FIO_BASE_ADDR + 0x58))
#define FIO2CLR        (*(reg32 *)(FIO_BASE_ADDR + 0x5C))

// PORT 3 acesso 32 bits
#define FIO3DIR        (*(reg32 *)(FIO_BASE_ADDR + 0x60))
#define FIO3MASK       (*(reg32 *)(FIO_BASE_ADDR + 0x70))
#define FIO3PIN        (*(reg32 *)(FIO_BASE_ADDR + 0x74))
#define FIO3SET        (*(reg32 *)(FIO_BASE_ADDR + 0x78))
#define FIO3CLR        (*(reg32 *)(FIO_BASE_ADDR + 0x7C))

// PORT 4 acesso 32 bits
#define FIO4DIR        (*(reg32 *)(FIO_BASE_ADDR + 0x80))
#define FIO4MASK       (*(reg32 *)(FIO_BASE_ADDR + 0x90))
#define FIO4PIN        (*(reg32 *)(FIO_BASE_ADDR + 0x94))
#define FIO4SET        (*(reg32 *)(FIO_BASE_ADDR + 0x98))
#define FIO4CLR        (*(reg32 *)(FIO_BASE_ADDR + 0x9C))

// PORT 5 acesso 32 bits
#define FIO5DIR        (*(reg32 *)(FIO_BASE_ADDR + 0xA0))
#define FIO5MASK       (*(reg32 *)(FIO_BASE_ADDR + 0xB0))
#define FIO5PIN        (*(reg32 *)(FIO_BASE_ADDR + 0xB4))
#define FIO5SET        (*(reg32 *)(FIO_BASE_ADDR + 0xB8))
#define FIO5CLR        (*(reg32 *)(FIO_BASE_ADDR + 0xBC))

