andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
// PORT 0 acesso 16 bits
#define FIO0DIRL       (*(reg16 *)(FIO_BASE_ADDR + 0x00))
#define FIO0DIRU       (*(reg16 *)(FIO_BASE_ADDR + 0x02))
#define FIO0MASKL      (*(reg16 *)(FIO_BASE_ADDR + 0x10))
#define FIO0MASKU      (*(reg16 *)(FIO_BASE_ADDR + 0x12))
#define FIO0PINL       (*(reg16 *)(FIO_BASE_ADDR + 0x14))
#define FIO0PINU       (*(reg16 *)(FIO_BASE_ADDR + 0x16))
#define FIO0SETL       (*(reg16 *)(FIO_BASE_ADDR + 0x18))
#define FIO0SETU       (*(reg16 *)(FIO_BASE_ADDR + 0x1A))
#define FIO0CLRL       (*(reg16 *)(FIO_BASE_ADDR + 0x1C))
#define FIO0CLRU       (*(reg16 *)(FIO_BASE_ADDR + 0x1E))

// PORT 1 acesso 16 bits
#define FIO1DIRL       (*(reg16 *)(FIO_BASE_ADDR + 0x20))
#define FIO1DIRU       (*(reg16 *)(FIO_BASE_ADDR + 0x22))
#define FIO1MASKL      (*(reg16 *)(FIO_BASE_ADDR + 0x30))
#define FIO1MASKU      (*(reg16 *)(FIO_BASE_ADDR + 0x32))
#define FIO1PINL       (*(reg16 *)(FIO_BASE_ADDR + 0x34))
#define FIO1PINU       (*(reg16 *)(FIO_BASE_ADDR + 0x36))
#define FIO1SETL       (*(reg16 *)(FIO_BASE_ADDR + 0x38))
#define FIO1SETU       (*(reg16 *)(FIO_BASE_ADDR + 0x3A))
#define FIO1CLRL       (*(reg16 *)(FIO_BASE_ADDR + 0x3C))
#define FIO1CLRU       (*(reg16 *)(FIO_BASE_ADDR + 0x3E))

// PORT 2 acesso 16 bits
#define FIO2DIRL       (*(reg16 *)(FIO_BASE_ADDR + 0x40))
#define FIO2DIRU       (*(reg16 *)(FIO_BASE_ADDR + 0x42))
#define FIO2MASKL      (*(reg16 *)(FIO_BASE_ADDR + 0x50))
#define FIO2MASKU      (*(reg16 *)(FIO_BASE_ADDR + 0x52))
#define FIO2PINL       (*(reg16 *)(FIO_BASE_ADDR + 0x54))
#define FIO2PINU       (*(reg16 *)(FIO_BASE_ADDR + 0x56))
#define FIO2SETL       (*(reg16 *)(FIO_BASE_ADDR + 0x58))
#define FIO2SETU       (*(reg16 *)(FIO_BASE_ADDR + 0x5A))
#define FIO2CLRL       (*(reg16 *)(FIO_BASE_ADDR + 0x5C))
#define FIO2CLRU       (*(reg16 *)(FIO_BASE_ADDR + 0x5E))

// PORT 3 acesso 16 bits
#define FIO3DIRL       (*(reg16 *)(FIO_BASE_ADDR + 0x60))
#define FIO3DIRU       (*(reg16 *)(FIO_BASE_ADDR + 0x62))
#define FIO3MASKL      (*(reg16 *)(FIO_BASE_ADDR + 0x70))
#define FIO3MASKU      (*(reg16 *)(FIO_BASE_ADDR + 0x72))
#define FIO3PINL       (*(reg16 *)(FIO_BASE_ADDR + 0x74))
#define FIO3PINU       (*(reg16 *)(FIO_BASE_ADDR + 0x76))
#define FIO3SETL       (*(reg16 *)(FIO_BASE_ADDR + 0x78))
#define FIO3SETU       (*(reg16 *)(FIO_BASE_ADDR + 0x7A))
#define FIO3CLRL       (*(reg16 *)(FIO_BASE_ADDR + 0x7C))
#define FIO3CLRU       (*(reg16 *)(FIO_BASE_ADDR + 0x7E))

// PORT 4 acesso 16 bits
#define FIO4DIRL       (*(reg16 *)(FIO_BASE_ADDR + 0x80))
#define FIO4DIRU       (*(reg16 *)(FIO_BASE_ADDR + 0x82))
#define FIO4MASKL      (*(reg16 *)(FIO_BASE_ADDR + 0x90))
#define FIO4MASKU      (*(reg16 *)(FIO_BASE_ADDR + 0x92))
#define FIO4PINL       (*(reg16 *)(FIO_BASE_ADDR + 0x94))
#define FIO4PINU       (*(reg16 *)(FIO_BASE_ADDR + 0x96))
#define FIO4SETL       (*(reg16 *)(FIO_BASE_ADDR + 0x98))
#define FIO4SETU       (*(reg16 *)(FIO_BASE_ADDR + 0x9A))
#define FIO4CLRL       (*(reg16 *)(FIO_BASE_ADDR + 0x9C))
#define FIO4CLRU       (*(reg16 *)(FIO_BASE_ADDR + 0x9E))

// PORT 5 acesso 16 bits
#define FIO5DIRL       (*(reg16 *)(FIO_BASE_ADDR + 0xA0))
#define FIO5DIRU       (*(reg16 *)(FIO_BASE_ADDR + 0xA2))
#define FIO5MASKL      (*(reg16 *)(FIO_BASE_ADDR + 0xB0))
#define FIO5MASKU      (*(reg16 *)(FIO_BASE_ADDR + 0xB2))
#define FIO5PINL       (*(reg16 *)(FIO_BASE_ADDR + 0xB4))
#define FIO5PINU       (*(reg16 *)(FIO_BASE_ADDR + 0xB6))
#define FIO5SETL       (*(reg16 *)(FIO_BASE_ADDR + 0xB8))
#define FIO5SETU       (*(reg16 *)(FIO_BASE_ADDR + 0xBA))
#define FIO5CLRL       (*(reg16 *)(FIO_BASE_ADDR + 0xBC))
#define FIO5CLRU       (*(reg16 *)(FIO_BASE_ADDR + 0xBE))

// PORT 0 acesso 8 bits
#define FIO0DIR0       (*(reg8 *)(FIO_BASE_ADDR + 0x00))
#define FIO0DIR1       (*(reg8 *)(FIO_BASE_ADDR + 0x01))
#define FIO0DIR2       (*(reg8 *)(FIO_BASE_ADDR + 0x02))
#define FIO0DIR3       (*(reg8 *)(FIO_BASE_ADDR + 0x03))
#define FIO0MASK0      (*(reg8 *)(FIO_BASE_ADDR + 0x10))
#define FIO0MASK1      (*(reg8 *)(FIO_BASE_ADDR + 0x11))
#define FIO0MASK2      (*(reg8 *)(FIO_BASE_ADDR + 0x12))
#define FIO0MASK3      (*(reg8 *)(FIO_BASE_ADDR + 0x13))
#define FIO0PIN0       (*(reg8 *)(FIO_BASE_ADDR + 0x14))
#define FIO0PIN1       (*(reg8 *)(FIO_BASE_ADDR + 0x15))
#define FIO0PIN2       (*(reg8 *)(FIO_BASE_ADDR + 0x16))
#define FIO0PIN3       (*(reg8 *)(FIO_BASE_ADDR + 0x17))
#define FIO0SET0       (*(reg8 *)(FIO_BASE_ADDR + 0x18))
#define FIO0SET1       (*(reg8 *)(FIO_BASE_ADDR + 0x19))
#define FIO0SET2       (*(reg8 *)(FIO_BASE_ADDR + 0x1A))
#define FIO0SET3       (*(reg8 *)(FIO_BASE_ADDR + 0x1B))
#define FIO0CLR0       (*(reg8 *)(FIO_BASE_ADDR + 0x1C))
#define FIO0CLR1       (*(reg8 *)(FIO_BASE_ADDR + 0x1D))
#define FIO0CLR2       (*(reg8 *)(FIO_BASE_ADDR + 0x1E))
#define FIO0CLR3       (*(reg8 *)(FIO_BASE_ADDR + 0x1F))

// PORT 1 acesso 8 bits
#define FIO1DIR0       (*(reg8 *)(FIO_BASE_ADDR + 0x20))
#define FIO1DIR1       (*(reg8 *)(FIO_BASE_ADDR + 0x21))
#define FIO1DIR2       (*(reg8 *)(FIO_BASE_ADDR + 0x22))
#define FIO1DIR3       (*(reg8 *)(FIO_BASE_ADDR + 0x23))
#define FIO1MASK0      (*(reg8 *)(FIO_BASE_ADDR + 0x30))
#define FIO1MASK1      (*(reg8 *)(FIO_BASE_ADDR + 0x31))
#define FIO1MASK2      (*(reg8 *)(FIO_BASE_ADDR + 0x32))
#define FIO1MASK3      (*(reg8 *)(FIO_BASE_ADDR + 0x33))
#define FIO1PIN0       (*(reg8 *)(FIO_BASE_ADDR + 0x34))
#define FIO1PIN1       (*(reg8 *)(FIO_BASE_ADDR + 0x35))
#define FIO1PIN2       (*(reg8 *)(FIO_BASE_ADDR + 0x36))
#define FIO1PIN3       (*(reg8 *)(FIO_BASE_ADDR + 0x37))
#define FIO1SET0       (*(reg8 *)(FIO_BASE_ADDR + 0x38))
#define FIO1SET1       (*(reg8 *)(FIO_BASE_ADDR + 0x39))
#define FIO1SET2       (*(reg8 *)(FIO_BASE_ADDR + 0x3A))
#define FIO1SET3       (*(reg8 *)(FIO_BASE_ADDR + 0x3B))
#define FIO1CLR0       (*(reg8 *)(FIO_BASE_ADDR + 0x3C))
#define FIO1CLR1       (*(reg8 *)(FIO_BASE_ADDR + 0x3D))
#define FIO1CLR2       (*(reg8 *)(FIO_BASE_ADDR + 0x3E))
#define FIO1CLR3       (*(reg8 *)(FIO_BASE_ADDR + 0x3F))

// PORT 2 acesso 8 bits
#define FIO2DIR0       (*(reg8 *)(FIO_BASE_ADDR + 0x40))
#define FIO2DIR1       (*(reg8 *)(FIO_BASE_ADDR + 0x41))
#define FIO2DIR2       (*(reg8 *)(FIO_BASE_ADDR + 0x42))
#define FIO2DIR3       (*(reg8 *)(FIO_BASE_ADDR + 0x43))
#define FIO2MASK0      (*(reg8 *)(FIO_BASE_ADDR + 0x50))
#define FIO2MASK1      (*(reg8 *)(FIO_BASE_ADDR + 0x51))
#define FIO2MASK2      (*(reg8 *)(FIO_BASE_ADDR + 0x52))
#define FIO2MASK3      (*(reg8 *)(FIO_BASE_ADDR + 0x53))
#define FIO2PIN0       (*(reg8 *)(FIO_BASE_ADDR + 0x54))
#define FIO2PIN1       (*(reg8 *)(FIO_BASE_ADDR + 0x55))
#define FIO2PIN2       (*(reg8 *)(FIO_BASE_ADDR + 0x56))
#define FIO2PIN3       (*(reg8 *)(FIO_BASE_ADDR + 0x57))
#define FIO2SET0       (*(reg8 *)(FIO_BASE_ADDR + 0x58))
#define FIO2SET1       (*(reg8 *)(FIO_BASE_ADDR + 0x59))
#define FIO2SET2       (*(reg8 *)(FIO_BASE_ADDR + 0x5A))
#define FIO2SET3       (*(reg8 *)(FIO_BASE_ADDR + 0x5B))
#define FIO2CLR0       (*(reg8 *)(FIO_BASE_ADDR + 0x5C))
#define FIO2CLR1       (*(reg8 *)(FIO_BASE_ADDR + 0x5D))
#define FIO2CLR2       (*(reg8 *)(FIO_BASE_ADDR + 0x5E))
#define FIO2CLR3       (*(reg8 *)(FIO_BASE_ADDR + 0x5F))

