andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
// PORT 3 acesso 8 bits
#define FIO3DIR0       (*(reg8 *)(FIO_BASE_ADDR + 0x60))
#define FIO3DIR1       (*(reg8 *)(FIO_BASE_ADDR + 0x61))
#define FIO3DIR2       (*(reg8 *)(FIO_BASE_ADDR + 0x62))
#define FIO3DIR3       (*(reg8 *)(FIO_BASE_ADDR + 0x63))
#define FIO3MASK0      (*(reg8 *)(FIO_BASE_ADDR + 0x70))
#define FIO3MASK1      (*(reg8 *)(FIO_BASE_ADDR + 0x71))
#define FIO3MASK2      (*(reg8 *)(FIO_BASE_ADDR + 0x72))
#define FIO3MASK3      (*(reg8 *)(FIO_BASE_ADDR + 0x73))
#define FIO3PIN0       (*(reg8 *)(FIO_BASE_ADDR + 0x74))
#define FIO3PIN1       (*(reg8 *)(FIO_BASE_ADDR + 0x75))
#define FIO3PIN2       (*(reg8 *)(FIO_BASE_ADDR + 0x76))
#define FIO3PIN3       (*(reg8 *)(FIO_BASE_ADDR + 0x77))
#define FIO3SET0       (*(reg8 *)(FIO_BASE_ADDR + 0x78))
#define FIO3SET1       (*(reg8 *)(FIO_BASE_ADDR + 0x79))
#define FIO3SET2       (*(reg8 *)(FIO_BASE_ADDR + 0x7A))
#define FIO3SET3       (*(reg8 *)(FIO_BASE_ADDR + 0x7B))
#define FIO3CLR0       (*(reg8 *)(FIO_BASE_ADDR + 0x7C))
#define FIO3CLR1       (*(reg8 *)(FIO_BASE_ADDR + 0x7D))
#define FIO3CLR2       (*(reg8 *)(FIO_BASE_ADDR + 0x7E))
#define FIO3CLR3       (*(reg8 *)(FIO_BASE_ADDR + 0x7F))

// PORT 4 acesso 8 bits
#define FIO4DIR0       (*(reg8 *)(FIO_BASE_ADDR + 0x80))
#define FIO4DIR1       (*(reg8 *)(FIO_BASE_ADDR + 0x81))
#define FIO4DIR2       (*(reg8 *)(FIO_BASE_ADDR + 0x82))
#define FIO4DIR3       (*(reg8 *)(FIO_BASE_ADDR + 0x83))
#define FIO4MASK0      (*(reg8 *)(FIO_BASE_ADDR + 0x90))
#define FIO4MASK1      (*(reg8 *)(FIO_BASE_ADDR + 0x91))
#define FIO4MASK2      (*(reg8 *)(FIO_BASE_ADDR + 0x92))
#define FIO4MASK3      (*(reg8 *)(FIO_BASE_ADDR + 0x93))
#define FIO4PIN0       (*(reg8 *)(FIO_BASE_ADDR + 0x94))
#define FIO4PIN1       (*(reg8 *)(FIO_BASE_ADDR + 0x95))
#define FIO4PIN2       (*(reg8 *)(FIO_BASE_ADDR + 0x96))
#define FIO4PIN3       (*(reg8 *)(FIO_BASE_ADDR + 0x97))
#define FIO4SET0       (*(reg8 *)(FIO_BASE_ADDR + 0x98))
#define FIO4SET1       (*(reg8 *)(FIO_BASE_ADDR + 0x99))
#define FIO4SET2       (*(reg8 *)(FIO_BASE_ADDR + 0x9A))
#define FIO4SET3       (*(reg8 *)(FIO_BASE_ADDR + 0x9B))
#define FIO4CLR0       (*(reg8 *)(FIO_BASE_ADDR + 0x9C))
#define FIO4CLR1       (*(reg8 *)(FIO_BASE_ADDR + 0x9D))
#define FIO4CLR2       (*(reg8 *)(FIO_BASE_ADDR + 0x9E))
#define FIO4CLR3       (*(reg8 *)(FIO_BASE_ADDR + 0x9F))

// PORT 5 acesso 8 bits
#define FIO5DIR0       (*(reg8 *)(FIO_BASE_ADDR + 0xA0))
#define FIO5DIR1       (*(reg8 *)(FIO_BASE_ADDR + 0xA1))
#define FIO5DIR2       (*(reg8 *)(FIO_BASE_ADDR + 0xA2))
#define FIO5DIR3       (*(reg8 *)(FIO_BASE_ADDR + 0xA3))
#define FIO5MASK0      (*(reg8 *)(FIO_BASE_ADDR + 0xB0))
#define FIO5MASK1      (*(reg8 *)(FIO_BASE_ADDR + 0xB1))
#define FIO5MASK2      (*(reg8 *)(FIO_BASE_ADDR + 0xB2))
#define FIO5MASK3      (*(reg8 *)(FIO_BASE_ADDR + 0xB3))
#define FIO5PIN0       (*(reg8 *)(FIO_BASE_ADDR + 0xB4))
#define FIO5PIN1       (*(reg8 *)(FIO_BASE_ADDR + 0xB5))
#define FIO5PIN2       (*(reg8 *)(FIO_BASE_ADDR + 0xB6))
#define FIO5PIN3       (*(reg8 *)(FIO_BASE_ADDR + 0xB7))
#define FIO5SET0       (*(reg8 *)(FIO_BASE_ADDR + 0xB8))
#define FIO5SET1       (*(reg8 *)(FIO_BASE_ADDR + 0xB9))
#define FIO5SET2       (*(reg8 *)(FIO_BASE_ADDR + 0xBA))
#define FIO5SET3       (*(reg8 *)(FIO_BASE_ADDR + 0xBB))
#define FIO5CLR0       (*(reg8 *)(FIO_BASE_ADDR + 0xBC))
#define FIO5CLR1       (*(reg8 *)(FIO_BASE_ADDR + 0xBD))
#define FIO5CLR2       (*(reg8 *)(FIO_BASE_ADDR + 0xBE))
#define FIO5CLR3       (*(reg8 *)(FIO_BASE_ADDR + 0xBF))



//// ########################################################################################################################################
//// CAN CONTROLLERS AND ACCEPTANCE FILTER
//#define CAN_ACCEPT_BASE_ADDR		0xE003C000
//#define CAN_AFMR		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x00))
//#define CAN_SFF_SA 		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x04))
//#define CAN_SFF_GRP_SA 	(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x08))
//#define CAN_EFF_SA 		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x0C))
//#define CAN_EFF_GRP_SA 	(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x10))
//#define CAN_EOT 		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x14))
//#define CAN_LUT_ERR_ADR (*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x18))
//#define CAN_LUT_ERR 	(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x1C))
//
//#define CAN_CENTRAL_BASE_ADDR		0xE0040000
//#define CAN_TX_SR 	(*(reg32 *)(CAN_CENTRAL_BASE_ADDR + 0x00))
//#define CAN_RX_SR 	(*(reg32 *)(CAN_CENTRAL_BASE_ADDR + 0x04))
//#define CAN_MSR 	(*(reg32 *)(CAN_CENTRAL_BASE_ADDR + 0x08))
//
//#define CAN1_BASE_ADDR		0xE0044000
//#define CAN1MOD 	(*(reg32 *)(CAN1_BASE_ADDR + 0x00))
//#define CAN1CMR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x04))
//#define CAN1GSR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x08))
//#define CAN1ICR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x0C))
//#define CAN1IER 	(*(reg32 *)(CAN1_BASE_ADDR + 0x10))
//#define CAN1BTR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x14))
//#define CAN1EWL 	(*(reg32 *)(CAN1_BASE_ADDR + 0x18))
//#define CAN1SR 		(*(reg32 *)(CAN1_BASE_ADDR + 0x1C))
//#define CAN1RFS 	(*(reg32 *)(CAN1_BASE_ADDR + 0x20))
//#define CAN1RID 	(*(reg32 *)(CAN1_BASE_ADDR + 0x24))
//#define CAN1RDA 	(*(reg32 *)(CAN1_BASE_ADDR + 0x28))
//#define CAN1RDB 	(*(reg32 *)(CAN1_BASE_ADDR + 0x2C))
//
//#define CAN1TFI1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x30))
//#define CAN1TID1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x34))
//#define CAN1TDA1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x38))
//#define CAN1TDB1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x3C))
//#define CAN1TFI2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x40))
//#define CAN1TID2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x44))
//#define CAN1TDA2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x48))
//#define CAN1TDB2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x4C))
//#define CAN1TFI3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x50))
//#define CAN1TID3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x54))
//#define CAN1TDA3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x58))
//#define CAN1TDB3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x5C))
//
//#define CAN2_BASE_ADDR		0xE0048000
//#define CAN2MOD 	(*(reg32 *)(CAN2_BASE_ADDR + 0x00))
//#define CAN2CMR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x04))
//#define CAN2GSR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x08))
//#define CAN2ICR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x0C))
//#define CAN2IER 	(*(reg32 *)(CAN2_BASE_ADDR + 0x10))
//#define CAN2BTR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x14))
//#define CAN2EWL 	(*(reg32 *)(CAN2_BASE_ADDR + 0x18))
//#define CAN2SR 		(*(reg32 *)(CAN2_BASE_ADDR + 0x1C))
//#define CAN2RFS 	(*(reg32 *)(CAN2_BASE_ADDR + 0x20))
//#define CAN2RID 	(*(reg32 *)(CAN2_BASE_ADDR + 0x24))
//#define CAN2RDA 	(*(reg32 *)(CAN2_BASE_ADDR + 0x28))
//#define CAN2RDB 	(*(reg32 *)(CAN2_BASE_ADDR + 0x2C))
//
//#define CAN2TFI1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x30))
//#define CAN2TID1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x34))
//#define CAN2TDA1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x38))
//#define CAN2TDB1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x3C))
//#define CAN2TFI2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x40))
//#define CAN2TID2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x44))
//#define CAN2TDA2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x48))
//#define CAN2TDB2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x4C))
//#define CAN2TFI3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x50))
//#define CAN2TID3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x54))
//#define CAN2TDA3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x58))
//#define CAN2TDB3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x5C))
//

//
//
//// ########################################################################################################################################
//// General-purpose DMA Controller
//#define DMA_BASE_ADDR		0xFFE04000
//#define GPDMA_INT_STAT         (*(reg32 *)(DMA_BASE_ADDR + 0x000))
//#define GPDMA_INT_TCSTAT       (*(reg32 *)(DMA_BASE_ADDR + 0x004))
//#define GPDMA_INT_TCCLR        (*(reg32 *)(DMA_BASE_ADDR + 0x008))
//#define GPDMA_INT_ERR_STAT     (*(reg32 *)(DMA_BASE_ADDR + 0x00C))
//#define GPDMA_INT_ERR_CLR      (*(reg32 *)(DMA_BASE_ADDR + 0x010))
//#define GPDMA_RAW_INT_TCSTAT   (*(reg32 *)(DMA_BASE_ADDR + 0x014))
//#define GPDMA_RAW_INT_ERR_STAT (*(reg32 *)(DMA_BASE_ADDR + 0x018))
//#define GPDMA_ENABLED_CHNS     (*(reg32 *)(DMA_BASE_ADDR + 0x01C))
//#define GPDMA_SOFT_BREQ        (*(reg32 *)(DMA_BASE_ADDR + 0x020))
//#define GPDMA_SOFT_SREQ        (*(reg32 *)(DMA_BASE_ADDR + 0x024))
//#define GPDMA_SOFT_LBREQ       (*(reg32 *)(DMA_BASE_ADDR + 0x028))
//#define GPDMA_SOFT_LSREQ       (*(reg32 *)(DMA_BASE_ADDR + 0x02C))
//#define GPDMA_CONFIG           (*(reg32 *)(DMA_BASE_ADDR + 0x030))
//#define GPDMA_SYNC             (*(reg32 *)(DMA_BASE_ADDR + 0x034))
//
//// DMA channel 0 registers
//#define GPDMA_CH0_SRC      (*(reg32 *)(DMA_BASE_ADDR + 0x100))
//#define GPDMA_CH0_DEST     (*(reg32 *)(DMA_BASE_ADDR + 0x104))
//#define GPDMA_CH0_LLI      (*(reg32 *)(DMA_BASE_ADDR + 0x108))
//#define GPDMA_CH0_CTRL     (*(reg32 *)(DMA_BASE_ADDR + 0x10C))
//#define GPDMA_CH0_CFG      (*(reg32 *)(DMA_BASE_ADDR + 0x110))
//
//// DMA channel 1 registers
//#define GPDMA_CH1_SRC      (*(reg32 *)(DMA_BASE_ADDR + 0x120))
//#define GPDMA_CH1_DEST     (*(reg32 *)(DMA_BASE_ADDR + 0x124))
//#define GPDMA_CH1_LLI      (*(reg32 *)(DMA_BASE_ADDR + 0x128))
//#define GPDMA_CH1_CTRL     (*(reg32 *)(DMA_BASE_ADDR + 0x12C))
//#define GPDMA_CH1_CFG      (*(reg32 *)(DMA_BASE_ADDR + 0x130))
//
// ########################################################################################################################################
// USB Controller
#define USB_INT_BASE_ADDR	0x400FC1C0
#define USB_BASE_ADDR		0x2008C200		// Endereço base dos registradores USB
#define USB_RAM_BASE		0x20000000		// Endereço base da SRAM interna reservado para o USB

//#define USB_INT_STAT    (*(reg32 *)(USB_INT_BASE_ADDR + 0x00))
//
//// USB Device Interrupt Registers
//#define DEV_INT_STAT    (*(reg32 *)(USB_BASE_ADDR + 0x00))
//#define DEV_INT_EN      (*(reg32 *)(USB_BASE_ADDR + 0x04))
//#define DEV_INT_CLR     (*(reg32 *)(USB_BASE_ADDR + 0x08))
//#define DEV_INT_SET     (*(reg32 *)(USB_BASE_ADDR + 0x0C))
//#define DEV_INT_PRIO    (*(reg32 *)(USB_BASE_ADDR + 0x2C))
//
//// USB Device Endpoint Interrupt Registers
//#define EP_INT_STAT     (*(reg32 *)(USB_BASE_ADDR + 0x30))
//#define EP_INT_EN       (*(reg32 *)(USB_BASE_ADDR + 0x34))
//#define EP_INT_CLR      (*(reg32 *)(USB_BASE_ADDR + 0x38))
//#define EP_INT_SET      (*(reg32 *)(USB_BASE_ADDR + 0x3C))
//#define EP_INT_PRIO     (*(reg32 *)(USB_BASE_ADDR + 0x40))
//
//// USB Device Endpoint Realization Registers
//#define REALIZE_EP      (*(reg32 *)(USB_BASE_ADDR + 0x44))
//#define EP_INDEX        (*(reg32 *)(USB_BASE_ADDR + 0x48))
//#define MAXPACKET_SIZE  (*(reg32 *)(USB_BASE_ADDR + 0x4C))
//
//// USB Device Command Reagisters
//#define CMD_CODE        (*(reg32 *)(USB_BASE_ADDR + 0x10))
//#define CMD_DATA        (*(reg32 *)(USB_BASE_ADDR + 0x14))
//
//// USB Device Data Transfer Registers
//#define RX_DATA         (*(reg32 *)(USB_BASE_ADDR + 0x18))
//#define TX_DATA         (*(reg32 *)(USB_BASE_ADDR + 0x1C))
//#define RX_PLENGTH      (*(reg32 *)(USB_BASE_ADDR + 0x20))
//#define TX_PLENGTH      (*(reg32 *)(USB_BASE_ADDR + 0x24))
//#define USB_CTRL        (*(reg32 *)(USB_BASE_ADDR + 0x28))
//
//// USB Device DMA Registers
//#define DMA_REQ_STAT        (*(reg32 *)(USB_BASE_ADDR + 0x50))
//#define DMA_REQ_CLR         (*(reg32 *)(USB_BASE_ADDR + 0x54))
//#define DMA_REQ_SET         (*(reg32 *)(USB_BASE_ADDR + 0x58))
//#define UDCA_HEAD           (*(reg32 *)(USB_BASE_ADDR + 0x80))
//#define EP_DMA_STAT         (*(reg32 *)(USB_BASE_ADDR + 0x84))
//#define EP_DMA_EN           (*(reg32 *)(USB_BASE_ADDR + 0x88))
//#define EP_DMA_DIS          (*(reg32 *)(USB_BASE_ADDR + 0x8C))
//#define DMA_INT_STAT        (*(reg32 *)(USB_BASE_ADDR + 0x90))
//#define DMA_INT_EN          (*(reg32 *)(USB_BASE_ADDR + 0x94))
//#define EOT_INT_STAT        (*(reg32 *)(USB_BASE_ADDR + 0xA0))
//#define EOT_INT_CLR         (*(reg32 *)(USB_BASE_ADDR + 0xA4))
//#define EOT_INT_SET         (*(reg32 *)(USB_BASE_ADDR + 0xA8))
//#define NDD_REQ_INT_STAT    (*(reg32 *)(USB_BASE_ADDR + 0xAC))
//#define NDD_REQ_INT_CLR     (*(reg32 *)(USB_BASE_ADDR + 0xB0))
//#define NDD_REQ_INT_SET     (*(reg32 *)(USB_BASE_ADDR + 0xB4))
//#define SYS_ERR_INT_STAT    (*(reg32 *)(USB_BASE_ADDR + 0xB8))
//#define SYS_ERR_INT_CLR     (*(reg32 *)(USB_BASE_ADDR + 0xBC))
//#define SYS_ERR_INT_SET     (*(reg32 *)(USB_BASE_ADDR + 0xC0))
//

// ########################################################################################################################################
// QEI - Quadrature Encoder Interface
#define QEI_BASE_ADDR		0x400BC000

// Control registers
#define QEICON          	(*(reg32 *)(QEI_BASE_ADDR + 0x00))
	#define QEI_CON_RESP		(1<<0)		// Reset position counter
	#define QEI_CON_RESPI		(1<<1)		// Reset Posistion Counter on Index
	#define QEI_CON_RESV		(1<<2)		// Reset Velocity
	#define QEI_CON_RESI		(1<<3)		// Reset Index Counter
	#define QEI_CON_BITMASK		(0x0F)		// QEI Control register bit-mask
	#define QEI_RESET_POS			QEI_CON_RESP		// Reset position counter
	#define QEI_RESET_POSOnIDX		QEI_CON_RESPI		// Reset Posistion Counter on Index
	#define QEI_RESET_VEL			QEI_CON_RESV		// Reset Velocity
	#define QEI_RESET_IDX			QEI_CON_RESI		// Reset Index Counter

