andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc175x.h
#define QEICONF           	(*(reg32 *)(QEI_BASE_ADDR + 0x08))
	#define QEI_CONF_DIRINV				(1<<0)		// Inversão de direção
		#define QEI_DIRINV_CMPL			(1<<0)		// A direção QEI é complementado
		#define QEI_DIRINV_NONE			(0)			// A direção QEI é normal
	#define QEI_CONF_SIGMODE			(1<<1)		// Modo do sinal
		#define QEI_SIGNALMODE_CLKDIR	(1<<1)		// Modo do sinal por clock/direção, onde PHA usado para determinar a direção e PHB para coletar o pulso
		#define QEI_SIGNALMODE_QUAD		(0)			// Modo do sinal por fase, usando PHA e PHB para detectar a fase
	#define QEI_CONF_CAPMODE			(1<<2)		// Modo de captura
		#define QEI_CAPMODE_2X			(0)			// Modo de captura utilizando somente a brdas do sinal PhA para contagem (2X)
		#define QEI_CAPMODE_4X			(1<<2)		// Modo de captura utilizando as bordas dos sinais PhA and PhB para contagem (4X)
	#define QEI_CONF_INVINX				(1<<3)		// Inversão do sinal INDEX
		#define QEI_INVINX_NONE			(0)			// Sem inversão do sinal INDEX
		#define QEI_INVINX_EN			(1<<3)		// Com inversão do sinal INDEX
	#define QEI_CONF_BITMASK	(0x0F)		// QEI Configuration register bit-mask

#define QEISTAT           	(*(reg32 *)(QEI_BASE_ADDR + 0x04))
	#define QEI_STAT_DIR		(1<<0)		// Direction bit
	#define QEI_STAT_BITMASK	(1<<0)		// QEI status register bit-mask

// Position, index, and timer registers
#define QEIPOS				(*(reg32 *)(QEI_BASE_ADDR + 0x0C))
#define QEIMAXPOS			(*(reg32 *)(QEI_BASE_ADDR + 0x10))

#define CMPOS0				(*(reg32 *)(QEI_BASE_ADDR + 0x14))
#define CMPOS1				(*(reg32 *)(QEI_BASE_ADDR + 0x18))
#define CMPOS2				(*(reg32 *)(QEI_BASE_ADDR + 0x1C))
	#define QEI_COMPPOS_CH_0			((u8)(0))		// QEI compare position channel 0
	#define QEI_COMPPOS_CH_1			((u8)(1))		// QEI compare position channel 1
	#define QEI_COMPPOS_CH_2			((u8)(2))		// QEI compare position channel 2
	#define PARAM_QEI_COMPPOS_CH(n)		((n==QEI_COMPPOS_CH_0) || (n==QEI_COMPPOS_CH_1) || (n==QEI_COMPPOS_CH_2))

#define INXCNT				(*(reg32 *)(QEI_BASE_ADDR + 0x20))
#define INXCMP				(*(reg32 *)(QEI_BASE_ADDR + 0x24))
#define QEILOAD				(*(reg32 *)(QEI_BASE_ADDR + 0x28))
#define QEITIME				(*(reg32 *)(QEI_BASE_ADDR + 0x2C))
#define QEIVEL				(*(reg32 *)(QEI_BASE_ADDR + 0x30))
#define QEICAP				(*(reg32 *)(QEI_BASE_ADDR + 0x34))
#define VELCOMP				(*(reg32 *)(QEI_BASE_ADDR + 0x38))
#define FILTER				(*(reg32 *)(QEI_BASE_ADDR + 0x3C))

// Interrupt registers
#define QEIINTSTAT			(*(reg32 *)(QEI_BASE_ADDR + 0xFE0)) // Sinaliza qual interrupção foi gerada
#define QEISET				(*(reg32 *)(QEI_BASE_ADDR + 0xFEC)) // Colocar o valor 1 no bit deste registrador seta o bit correspondente em QEIINTSTAT
#define QEICLR				(*(reg32 *)(QEI_BASE_ADDR + 0xFE8)) // Colocar o valor 1 no bit deste registrador limpa o bit correspondente em QEIINTSTAT
	#define QEI_INTCLR_BITMASK			(0x1FFF)	// QEI Interrupt Clear register bit-mask

#define QEIIE				(*(reg32 *)(QEI_BASE_ADDR + 0xFE4)) //
#define QEIIES				(*(reg32 *)(QEI_BASE_ADDR + 0xFDC)) // Colocar o valor 1 no bit deste registrador seta o bit correspondente em QEIIE
#define QEIIEC				(*(reg32 *)(QEI_BASE_ADDR + 0xFD8)) // Colocar o valor 1 no bit deste registrador limpa o bit correspondente em QEIIE
	#define QEI_IECLR_BITMASK			(0x1FFF)	// QEI Interrupt Enable Clear register bit-mask
	#define QEI_INTFLAG_INX_Int			(1<<0)		// index pulse was detected interrupt
	#define QEI_INTFLAG_TIM_Int			(1<<1)		// Velocity timer over flow interrupt
	#define QEI_INTFLAG_VELC_Int		(1<<2)		// Capture velocity is less than compare interrupt
	#define QEI_INTFLAG_DIR_Int			(1<<3)		// Change of direction interrupt
	#define QEI_INTFLAG_ERR_Int			(1<<4)		// An encoder phase error interrupt
	#define QEI_INTFLAG_ENCLK_Int		(1<<5)		// An encoder clock pulse was detected interrupt
	#define QEI_INTFLAG_POS0_Int		(1<<6)		// position 0 compare value is equal to the current position interrupt
	#define QEI_INTFLAG_POS1_Int		(1<<7)		// position 1 compare value is equal to the current position interrupt
	#define QEI_INTFLAG_POS2_Int		(1<<8)		// position 2 compare value is equal to the current position interrupt
	#define QEI_INTFLAG_REV_Int			(1<<9)		// Index compare value is equal to the current index count interrupt
	#define QEI_INTFLAG_POS0REV_Int		(1<<10)		// Combined position 0 and revolution count interrupt
	#define QEI_INTFLAG_POS1REV_Int		(1<<11)		// Combined position 1 and revolution count interrupt
	#define QEI_INTFLAG_POS2REV_Int		(1<<12)		// Combined position 2 and revolution count interrupt


// ########################################################################################################################################
// IAP/ISP
#define IAP_LOCATION            (0x1FFF1FF1) // Definindo o ponto de entrada das funções IAP
#define IAP_CMD_PREPARE         (50)
#define IAP_CMD_COPYRAMTOFLASH  (51)
#define IAP_CMD_ERASE           (52)
#define IAP_CMD_BLANKCHECK      (53)
#define IAP_CMD_READPARTID      (54)
#define IAP_CMD_READBOOTCODEVER (55)
#define IAP_CMD_COMPARE         (56)
#define IAP_CMD_REINVOKEISP     (57)

#endif
